Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 160, 168, 1)       0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 80, 84, 64)        640       
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 40, 42, 64)        36928     
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 20, 21, 64)        36928     
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 10, 11, 64)        36928     
_________________________________________________________________
reshape_5 (Reshape)          (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 512)               3604992   
_________________________________________________________________
latent_space (Dense)         (None, 128)               65664     
=================================================================
Total params: 3,782,080
Trainable params: 3,782,080
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 128)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 7040)              908160    
_________________________________________________________________
reshape_6 (Reshape)          (None, 10, 11, 64)        0         
_________________________________________________________________
conv2d_transpose_11 (Conv2DT (None, 20, 22, 64)        36928     
_________________________________________________________________
conv2d_transpose_12 (Conv2DT (None, 40, 44, 64)        36928     
_________________________________________________________________
conv2d_transpose_13 (Conv2DT (None, 80, 88, 64)        36928     
_________________________________________________________________
conv2d_transpose_14 (Conv2DT (None, 160, 176, 64)      36928     
_________________________________________________________________
conv2d_transpose_15 (Conv2DT (None, 160, 176, 1)       577       
_________________________________________________________________
cropping2d_3 (Cropping2D)    (None, 160, 168, 1)       0         
_________________________________________________________________
decoder_output (Activation)  (None, 160, 168, 1)       0         
=================================================================
Total params: 1,056,449
Trainable params: 1,056,449
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 160, 168, 1)       0         
_________________________________________________________________
encoder (Model)              (None, 128)               3782080   
_________________________________________________________________
decoder (Model)              (None, 160, 168, 1)       1056449   
=================================================================
Total params: 4,838,529
Trainable params: 4,838,529
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 160, 168, 1)       0         
_________________________________________________________________
encoder (Model)              (None, 128)               3782080   
_________________________________________________________________
decoder (Model)              (None, 160, 168, 1)       1056449   
=================================================================
Total params: 4,838,529
Trainable params: 4,838,529
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.04434149927149216, 0.041353522477050625, 0.03991514975825945, 0.0389665987342596, 0.038026180068651834, 0.037270767899851, 0.03714645894865195, 0.03621126693983873, 0.035980319728453954, 0.035971016051868594], 'loss': [0.050530171301215884, 0.04330883012153208, 0.0405654810120662, 0.0385436298760275, 0.037175713152003784, 0.03607140745036304, 0.035256912584106126, 0.03434882104086379, 0.03375797213365634, 0.03311135863574843]}