Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 309, 84, 1)   0                                            
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 155, 42, 64)  640         encoded_input[0][0]              
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 78, 21, 64)   36928       conv2d_13[0][0]                  
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 39, 11, 64)   36928       conv2d_14[0][0]                  
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 20, 6, 64)    36928       conv2d_15[0][0]                  
__________________________________________________________________________________________________
reshape_7 (Reshape)             (None, 7680)         0           conv2d_16[0][0]                  
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 1024)         7865344     reshape_7[0][0]                  
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 256)          262400      dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 256)          262400      dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 256)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 8,501,568
Trainable params: 8,501,568
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 256)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 7680)              1973760   
_________________________________________________________________
reshape_8 (Reshape)          (None, 20, 6, 64)         0         
_________________________________________________________________
conv2d_transpose_16 (Conv2DT (None, 40, 12, 64)        36928     
_________________________________________________________________
conv2d_transpose_17 (Conv2DT (None, 80, 24, 64)        36928     
_________________________________________________________________
conv2d_transpose_18 (Conv2DT (None, 160, 48, 64)       36928     
_________________________________________________________________
conv2d_transpose_19 (Conv2DT (None, 320, 96, 64)       36928     
_________________________________________________________________
conv2d_transpose_20 (Conv2DT (None, 320, 96, 1)        577       
_________________________________________________________________
cropping2d_4 (Cropping2D)    (None, 309, 84, 1)        0         
_________________________________________________________________
decoder_output (Activation)  (None, 309, 84, 1)        0         
=================================================================
Total params: 2,122,049
Trainable params: 2,122,049
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
encoder (Model)              [(None, 256), (None, 256) 8501568   
_________________________________________________________________
decoder (Model)              (None, 309, 84, 1)        2122049   
=================================================================
Total params: 10,623,617
Trainable params: 10,623,617
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
encoder (Model)              [(None, 256), (None, 256) 8501568   
_________________________________________________________________
decoder (Model)              (None, 309, 84, 1)        2122049   
=================================================================
Total params: 10,623,617
Trainable params: 10,623,617
Non-trainable params: 0
_________________________________________________________________
val_loss: [0.01243324 0.01020429 0.00924155 0.00884957 0.00813612 0.00783653
 0.00727973 0.00713979 0.00677332 0.00664769 0.00651839 0.0065036
 0.00624239 0.00661928 0.00652259 0.00590773 0.00571238 0.00571035
 0.00561398 0.00615915 0.00579834 0.00540768 0.00541807 0.00532
 0.00523227 0.00526534 0.0056978  0.00509717 0.00517945 0.00515596]