Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 309, 84, 1)     0         
_________________________________________________________________
conv3d_61 (Conv3D)           (None, 1, 155, 42, 64)    1792      
_________________________________________________________________
conv3d_62 (Conv3D)           (None, 1, 78, 21, 64)     36928     
_________________________________________________________________
conv3d_63 (Conv3D)           (None, 1, 39, 11, 64)     36928     
_________________________________________________________________
conv3d_64 (Conv3D)           (None, 1, 20, 6, 64)      36928     
_________________________________________________________________
reshape_31 (Reshape)         (None, 7680)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 1024)              7865344   
_________________________________________________________________
latent_space (Dense)         (None, 512)               524800    
=================================================================
Total params: 8,502,720
Trainable params: 8,502,720
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 512)               0         
_________________________________________________________________
dense_16 (Dense)             (None, 7680)              3939840   
_________________________________________________________________
reshape_32 (Reshape)         (None, 1, 20, 6, 64)      0         
_________________________________________________________________
conv3d_transpose_76 (Conv3DT (None, 1, 40, 12, 64)     36928     
_________________________________________________________________
conv3d_transpose_77 (Conv3DT (None, 1, 80, 24, 64)     36928     
_________________________________________________________________
conv3d_transpose_78 (Conv3DT (None, 1, 160, 48, 64)    36928     
_________________________________________________________________
conv3d_transpose_79 (Conv3DT (None, 3, 320, 96, 64)    110656    
_________________________________________________________________
conv3d_transpose_80 (Conv3DT (None, 3, 320, 96, 1)     1729      
_________________________________________________________________
cropping3d_16 (Cropping3D)   (None, 3, 309, 84, 1)     0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 309, 84, 1)     0         
=================================================================
Total params: 4,163,009
Trainable params: 4,163,009
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 309, 84, 1)     0         
_________________________________________________________________
encoder (Model)              (None, 512)               8502720   
_________________________________________________________________
decoder (Model)              (None, 3, 309, 84, 1)     4163009   
=================================================================
Total params: 12,665,729
Trainable params: 12,665,729
Non-trainable params: 0
_________________________________________________________________
