Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 3, 160, 168,  0                                            
__________________________________________________________________________________________________
conv3d_9 (Conv3D)               (None, 1, 80, 84, 64 1792        encoded_input[0][0]              
__________________________________________________________________________________________________
conv3d_10 (Conv3D)              (None, 1, 40, 42, 64 36928       conv3d_9[0][0]                   
__________________________________________________________________________________________________
conv3d_11 (Conv3D)              (None, 1, 20, 21, 64 36928       conv3d_10[0][0]                  
__________________________________________________________________________________________________
conv3d_12 (Conv3D)              (None, 1, 10, 11, 64 36928       conv3d_11[0][0]                  
__________________________________________________________________________________________________
reshape_5 (Reshape)             (None, 7040)         0           conv3d_12[0][0]                  
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 1024)         7209984     reshape_5[0][0]                  
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 512)          524800      dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 512)          524800      dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 512)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 8,372,160
Trainable params: 8,372,160
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 512)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 7040)              3611520   
_________________________________________________________________
reshape_6 (Reshape)          (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_11 (Conv3DT (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_12 (Conv3DT (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_13 (Conv3DT (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_14 (Conv3DT (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_15 (Conv3DT (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_3 (Cropping3D)    (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 3,834,689
Trainable params: 3,834,689
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              [(None, 512), (None, 512) 8372160   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    3834689   
=================================================================
Total params: 12,206,849
Trainable params: 12,206,849
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.07288590037822723, 0.07187806046009064, 0.06912413781881332, 0.0679783262014389, 0.06714372849464416], 'loss': [0.08671489490568637, 0.07018875196576119, 0.06813271170854568, 0.06696137794852257, 0.06629754173755646]}