Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 309, 84, 1)   0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 155, 42, 64)  640         encoded_input[0][0]              
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 78, 21, 64)   36928       conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 39, 11, 64)   36928       conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 20, 6, 64)    36928       conv2d_3[0][0]                   
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 7680)         0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 1024)         7865344     reshape_1[0][0]                  
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 256)          262400      dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 256)          262400      dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 256)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 8,501,568
Trainable params: 8,501,568
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 7680)              1973760   
_________________________________________________________________
reshape_2 (Reshape)          (None, 20, 6, 64)         0         
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 40, 12, 64)        36928     
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 80, 24, 64)        36928     
_________________________________________________________________
conv2d_transpose_3 (Conv2DTr (None, 160, 48, 64)       36928     
_________________________________________________________________
conv2d_transpose_4 (Conv2DTr (None, 320, 96, 64)       36928     
_________________________________________________________________
conv2d_transpose_5 (Conv2DTr (None, 320, 96, 1)        577       
_________________________________________________________________
cropping2d_1 (Cropping2D)    (None, 309, 84, 1)        0         
_________________________________________________________________
decoder_output (Activation)  (None, 309, 84, 1)        0         
=================================================================
Total params: 2,122,049
Trainable params: 2,122,049
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
encoder (Model)              [(None, 256), (None, 256) 8501568   
_________________________________________________________________
decoder (Model)              (None, 309, 84, 1)        2122049   
=================================================================
Total params: 10,623,617
Trainable params: 10,623,617
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
encoder (Model)              [(None, 256), (None, 256) 8501568   
_________________________________________________________________
decoder (Model)              (None, 309, 84, 1)        2122049   
=================================================================
Total params: 10,623,617
Trainable params: 10,623,617
Non-trainable params: 0
_________________________________________________________________
val_loss: [0.01300866 0.00990669 0.00904576 0.0084025  0.00750568 0.00746495
 0.00705703 0.00725855 0.00663305 0.00636974 0.00668281 0.00614334
 0.00600958 0.00613717 0.00569009 0.0062474  0.00572301 0.00553998
 0.00554995 0.00557047 0.00572742 0.00533439 0.0056717  0.00553168
 0.00519252 0.00526151 0.00530905 0.00518236 0.00524219 0.00519893]