Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 160, 168, 1)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 80, 84, 64)        640       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 40, 42, 64)        36928     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 20, 21, 64)        36928     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 10, 11, 64)        36928     
_________________________________________________________________
reshape_1 (Reshape)          (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 512)               3604992   
_________________________________________________________________
latent_space (Dense)         (None, 128)               65664     
=================================================================
Total params: 3,782,080
Trainable params: 3,782,080
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 7040)              908160    
_________________________________________________________________
reshape_2 (Reshape)          (None, 10, 11, 64)        0         
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 20, 22, 64)        36928     
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 40, 44, 64)        36928     
_________________________________________________________________
conv2d_transpose_3 (Conv2DTr (None, 80, 88, 64)        36928     
_________________________________________________________________
conv2d_transpose_4 (Conv2DTr (None, 160, 176, 64)      36928     
_________________________________________________________________
conv2d_transpose_5 (Conv2DTr (None, 160, 176, 1)       577       
_________________________________________________________________
cropping2d_1 (Cropping2D)    (None, 160, 168, 1)       0         
_________________________________________________________________
decoder_output (Activation)  (None, 160, 168, 1)       0         
=================================================================
Total params: 1,056,449
Trainable params: 1,056,449
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 160, 168, 1)       0         
_________________________________________________________________
encoder (Model)              (None, 128)               3782080   
_________________________________________________________________
decoder (Model)              (None, 160, 168, 1)       1056449   
=================================================================
Total params: 4,838,529
Trainable params: 4,838,529
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 160, 168, 1)       0         
_________________________________________________________________
encoder (Model)              (None, 128)               3782080   
_________________________________________________________________
decoder (Model)              (None, 160, 168, 1)       1056449   
=================================================================
Total params: 4,838,529
Trainable params: 4,838,529
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.0423762600372235, 0.04033725678920746, 0.03897659125427405, 0.03770939273138841, 0.037097174723943076, 0.03615931864827871, 0.035153383972744146, 0.03468727039794127, 0.0351155836135149, 0.03440210623045763], 'loss': [0.04892900510070224, 0.041620744878115755, 0.03895620009241005, 0.03735487471024195, 0.03596191780952116, 0.03487851475675901, 0.033901512616624434, 0.03314934984470407, 0.03243366179211686, 0.03200246760000785]}