Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 155, 42, 64)       640       
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 78, 21, 64)        36928     
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 39, 11, 64)        36928     
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 20, 6, 64)         36928     
_________________________________________________________________
reshape_9 (Reshape)          (None, 7680)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 512)               3932672   
_________________________________________________________________
latent_space (Dense)         (None, 128)               65664     
=================================================================
Total params: 4,109,760
Trainable params: 4,109,760
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.015844728810091812, 0.006997622928271691, 0.005427461604898175, 0.004766779933124781, 0.0041550468901793165, 0.0038124709638456505, 0.0042523683048784735, 0.003541974934438864, 0.0032397611470272145, 0.003003039142737786], 'loss': [0.1203915936437746, 0.009222471831987301, 0.006171105264996489, 0.005081416505078475, 0.004245180847744147, 0.004019048903913547, 0.003914453495914737, 0.0033397716175143917, 0.0031385403972429534, 0.002957059843465686]}