Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
conv3d_13 (Conv3D)           (None, 1, 80, 84, 64)     1792      
_________________________________________________________________
conv3d_14 (Conv3D)           (None, 1, 40, 42, 64)     36928     
_________________________________________________________________
conv3d_15 (Conv3D)           (None, 1, 20, 21, 64)     36928     
_________________________________________________________________
conv3d_16 (Conv3D)           (None, 1, 10, 11, 64)     36928     
_________________________________________________________________
reshape_7 (Reshape)          (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 128)               901248    
_________________________________________________________________
latent_space (Dense)         (None, 32)                4128      
=================================================================
Total params: 1,017,952
Trainable params: 1,017,952
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.07444646644592286, 0.06682953280210495, 0.0551401073038578, 0.05148978114128113, 0.050132593959569934, 0.048085563957691195, 0.047100928336381916, 0.0461545579135418, 0.04557331466674805, 0.0448629792034626, 0.044808392524719236, 0.044182870596647265, 0.043624061733484265, 0.04394040548801422, 0.04329969942569733, 0.042245575189590455, 0.04204784280061722, 0.04144651824235916, 0.18172988069057464, 0.041287885427474975], 'loss': [0.2538011317700148, 0.07260885056853295, 0.05797953226417303, 0.054462730832397936, 0.05795313785970211, 0.04894318714737892, 0.04754548487812281, 0.0468231964558363, 0.04554423784464598, 0.04600293233990669, 0.044289329051971436, 0.04474195186048746, 0.043358089074492456, 0.0460455616787076, 0.04274260008335114, 0.04263283694535494, 0.041266639046370984, 0.04095342534035444, 0.04377850633859635, 0.04588051107525826]}loss_history: {'val_loss': [0.06869824796915054, 0.06367386823892593, 0.06190721708536148, 0.06134537321329117, 0.060273074090480806], 'loss': [0.07636909152567387, 0.06326488567888737, 0.06058021621406078, 0.05904391434788704, 0.05786356639862061]}