Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 155, 42, 64)       640       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 78, 21, 64)        36928     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 39, 11, 64)        36928     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 20, 6, 64)         36928     
_________________________________________________________________
reshape_1 (Reshape)          (None, 7680)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 512)               3932672   
_________________________________________________________________
latent_space (Dense)         (None, 128)               65664     
=================================================================
Total params: 4,109,760
Trainable params: 4,109,760
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.01199186290303866, 0.006706862275799115, 0.004782930193468929, 0.0041421174071729185, 0.0037729464502384265, 0.003363491389900446, 0.0033197213088472684, 0.00308532086511453, 0.0028269592951983215, 0.002707971455529332], 'loss': [0.08770982767765721, 0.008587037708299855, 0.005377351882246633, 0.004329104997062435, 0.003960858450736851, 0.0035029031701075534, 0.003172262912460913, 0.0029735077754594386, 0.00278816971850271, 0.0026351126888766885]}