Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
conv3d_17 (Conv3D)           (None, 1, 80, 84, 64)     1792      
_________________________________________________________________
conv3d_18 (Conv3D)           (None, 1, 40, 42, 64)     36928     
_________________________________________________________________
conv3d_19 (Conv3D)           (None, 1, 20, 21, 64)     36928     
_________________________________________________________________
conv3d_20 (Conv3D)           (None, 1, 10, 11, 64)     36928     
_________________________________________________________________
reshape_9 (Reshape)          (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 256)               1802496   
_________________________________________________________________
latent_space (Dense)         (None, 64)                16448     
=================================================================
Total params: 1,931,520
Trainable params: 1,931,520
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.22867039608955383, 0.05908567282557488, 0.052426328003406526, 0.049183573782444, 0.049426408618688585, 0.04613299733400345, 0.04477338743209839, 0.04405755999684334, 0.04393329334259033, 0.04280698385834694, 0.043489999622106555, 0.04177575027942657, 0.04129844936728477, 0.04088507467508316, 0.040405707985162735, 0.04071060857176781, 0.04022218975424766, 0.03975215241312981, 0.039519739001989365, 0.03904932636022568], 'loss': [0.4094726592898369, 0.07906987816095352, 0.0558842433989048, 0.05206853994727135, 0.04887010139226913, 0.05390038270503283, 0.04532853452116251, 0.044188588410615924, 0.043992007546126845, 0.04329998180270195, 0.04195189827680588, 0.05144102035462856, 0.04076391513645649, 0.04014682455360889, 0.0396547574698925, 0.03987908663600683, 0.03905743814259768, 0.03859209477156401, 0.04014646054059267, 0.03775636598467827]}loss_history: {'val_loss': [0.0651684485077858, 0.061914853632450105, 0.06020157903432846, 0.058894336760044096, 0.058565192699432375], 'loss': [0.07979286831617355, 0.060870499283075336, 0.058208671554923055, 0.056433129757642746, 0.055159951448440554]}