Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 309, 84, 1)     0         
_________________________________________________________________
conv3d_41 (Conv3D)           (None, 1, 155, 42, 64)    1792      
_________________________________________________________________
conv3d_42 (Conv3D)           (None, 1, 78, 21, 64)     36928     
_________________________________________________________________
conv3d_43 (Conv3D)           (None, 1, 39, 11, 64)     36928     
_________________________________________________________________
conv3d_44 (Conv3D)           (None, 1, 20, 6, 64)      36928     
_________________________________________________________________
reshape_21 (Reshape)         (None, 7680)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 512)               3932672   
_________________________________________________________________
latent_space (Dense)         (None, 256)               131328    
=================================================================
Total params: 4,176,576
Trainable params: 4,176,576
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 256)               0         
_________________________________________________________________
dense_11 (Dense)             (None, 7680)              1973760   
_________________________________________________________________
reshape_22 (Reshape)         (None, 1, 20, 6, 64)      0         
_________________________________________________________________
conv3d_transpose_51 (Conv3DT (None, 1, 40, 12, 64)     36928     
_________________________________________________________________
conv3d_transpose_52 (Conv3DT (None, 1, 80, 24, 64)     36928     
_________________________________________________________________
conv3d_transpose_53 (Conv3DT (None, 1, 160, 48, 64)    36928     
_________________________________________________________________
conv3d_transpose_54 (Conv3DT (None, 3, 320, 96, 64)    110656    
_________________________________________________________________
conv3d_transpose_55 (Conv3DT (None, 3, 320, 96, 1)     1729      
_________________________________________________________________
cropping3d_11 (Cropping3D)   (None, 3, 309, 84, 1)     0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 309, 84, 1)     0         
=================================================================
Total params: 2,196,929
Trainable params: 2,196,929
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 309, 84, 1)     0         
_________________________________________________________________
encoder (Model)              (None, 256)               4176576   
_________________________________________________________________
decoder (Model)              (None, 3, 309, 84, 1)     2196929   
=================================================================
Total params: 6,373,505
Trainable params: 6,373,505
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.003017883806799849, 0.00295202965537707, 0.003134621965388457, 0.0030868963183214265, 0.0027870334032922984], 'loss': [0.0043002220569178465, 0.002955823173591246, 0.0029736428956190744, 0.0030149232293479144, 0.0029785347799770536]}loss_history: {'val_loss': [0.0026407441527893146, 0.0027201130893081426, 0.002777997407441338, 0.002533168646817406, 0.002684153396015366], 'loss': [0.003831612636956076, 0.002617021521242956, 0.0026710713670278587, 0.0026233492232859133, 0.0025255187872486808]}