Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
conv3d_65 (Conv3D)           (None, 1, 80, 84, 64)     1792      
_________________________________________________________________
conv3d_66 (Conv3D)           (None, 1, 40, 42, 64)     36928     
_________________________________________________________________
conv3d_67 (Conv3D)           (None, 1, 20, 21, 64)     36928     
_________________________________________________________________
conv3d_68 (Conv3D)           (None, 1, 10, 11, 64)     36928     
_________________________________________________________________
reshape_33 (Reshape)         (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 1024)              7209984   
_________________________________________________________________
latent_space (Dense)         (None, 512)               524800    
=================================================================
Total params: 7,847,360
Trainable params: 7,847,360
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 512)               0         
_________________________________________________________________
dense_17 (Dense)             (None, 7040)              3611520   
_________________________________________________________________
reshape_34 (Reshape)         (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_81 (Conv3DT (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_82 (Conv3DT (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_83 (Conv3DT (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_84 (Conv3DT (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_85 (Conv3DT (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_17 (Cropping3D)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 3,834,689
Trainable params: 3,834,689
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              (None, 512)               7847360   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    3834689   
=================================================================
Total params: 11,682,049
Trainable params: 11,682,049
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.05036943703889847, 0.04809877455234528, 0.04732147657871246, 0.04643155798316002, 0.0456166145503521], 'loss': [0.05287664575874806, 0.04481410513818264, 0.04338903164118529, 0.04190584348887205, 0.04108226335048676]}