Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
conv3d_5 (Conv3D)            (None, 1, 80, 84, 64)     1792      
_________________________________________________________________
conv3d_6 (Conv3D)            (None, 1, 40, 42, 64)     36928     
_________________________________________________________________
conv3d_7 (Conv3D)            (None, 1, 20, 21, 64)     36928     
_________________________________________________________________
conv3d_8 (Conv3D)            (None, 1, 10, 11, 64)     36928     
_________________________________________________________________
reshape_3 (Reshape)          (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 1024)              7209984   
_________________________________________________________________
latent_space (Dense)         (None, 512)               524800    
=================================================================
Total params: 7,847,360
Trainable params: 7,847,360
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 512)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 7040)              3611520   
_________________________________________________________________
reshape_4 (Reshape)          (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_6 (Conv3DTr (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_7 (Conv3DTr (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_8 (Conv3DTr (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_9 (Conv3DTr (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_10 (Conv3DT (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_2 (Cropping3D)    (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 3,834,689
Trainable params: 3,834,689
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              (None, 512)               7847360   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    3834689   
=================================================================
Total params: 11,682,049
Trainable params: 11,682,049
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.051364157140254975, 0.049427426278591154, 0.04885081791877747, 0.04770629528164864, 0.04665221917629242], 'loss': [0.057043339416384696, 0.0467706956192851, 0.04486558336764574, 0.043601851209998134, 0.04217000020295381]}