Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 155, 42, 64)       640       
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 78, 21, 64)        36928     
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 39, 11, 64)        36928     
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 20, 6, 64)         36928     
_________________________________________________________________
reshape_9 (Reshape)          (None, 7680)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 512)               3932672   
_________________________________________________________________
latent_space (Dense)         (None, 128)               65664     
=================================================================
Total params: 4,109,760
Trainable params: 4,109,760
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 128)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 7680)              990720    
_________________________________________________________________
reshape_10 (Reshape)         (None, 20, 6, 64)         0         
_________________________________________________________________
conv2d_transpose_21 (Conv2DT (None, 40, 12, 64)        36928     
_________________________________________________________________
conv2d_transpose_22 (Conv2DT (None, 80, 24, 64)        36928     
_________________________________________________________________
conv2d_transpose_23 (Conv2DT (None, 160, 48, 64)       36928     
_________________________________________________________________
conv2d_transpose_24 (Conv2DT (None, 320, 96, 64)       36928     
_________________________________________________________________
conv2d_transpose_25 (Conv2DT (None, 320, 96, 1)        577       
_________________________________________________________________
cropping2d_5 (Cropping2D)    (None, 309, 84, 1)        0         
_________________________________________________________________
decoder_output (Activation)  (None, 309, 84, 1)        0         
=================================================================
Total params: 1,139,009
Trainable params: 1,139,009
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
encoder (Model)              (None, 128)               4109760   
_________________________________________________________________
decoder (Model)              (None, 309, 84, 1)        1139009   
=================================================================
Total params: 5,248,769
Trainable params: 5,248,769
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.005305073102936149, 0.0054833077142635986, 0.0024701128527522087, 0.0021975164247366287, 0.0017781192165178558, 0.0016724352018597226, 0.0020662544465934237, 0.0015076155844144523, 0.0013003624696284533, 0.0017384770458253721], 'loss': [0.05363622372038662, 0.004106936444683621, 0.002839664864198615, 0.0030067036029261846, 0.0018495946239757662, 0.001596209579341424, 0.0016343114525079728, 0.0015719685391134893, 0.0012779126884803797, 0.0012991273040339972]}