Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
conv3d_17 (Conv3D)           (None, 1, 80, 84, 64)     1792      
_________________________________________________________________
conv3d_18 (Conv3D)           (None, 1, 40, 42, 64)     36928     
_________________________________________________________________
conv3d_19 (Conv3D)           (None, 1, 20, 21, 64)     36928     
_________________________________________________________________
conv3d_20 (Conv3D)           (None, 1, 10, 11, 64)     36928     
_________________________________________________________________
reshape_9 (Reshape)          (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 128)               901248    
_________________________________________________________________
latent_space (Dense)         (None, 2)                 258       
=================================================================
Total params: 1,014,082
Trainable params: 1,014,082
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 2)                 0         
_________________________________________________________________
dense_5 (Dense)              (None, 7040)              21120     
_________________________________________________________________
reshape_10 (Reshape)         (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_21 (Conv3DT (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_22 (Conv3DT (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_23 (Conv3DT (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_24 (Conv3DT (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_25 (Conv3DT (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_5 (Cropping3D)    (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 244,289
Trainable params: 244,289
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              (None, 2)                 1014082   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    244289    
=================================================================
Total params: 1,258,371
Trainable params: 1,258,371
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.2052256780862808, 0.19353674566745757, 0.19183147013187407, 0.19150673627853393, 0.19092994892597198, 0.19391632056236266, 0.1908308596611023, 0.19063524663448334, 0.1919848780632019, 0.19012229573726655, 0.1920832369327545, 0.190743359208107, 0.19266637301445008, 0.1903317390680313, 0.19034599697589874, 0.19081109547615052, 0.19033858728408815, 0.1901710447072983, 0.19034970915317537, 0.19229185926914216], 'loss': [0.6368650466203689, 0.19832133454084397, 0.1937820118069649, 0.1929523606300354, 0.19239837396144868, 0.1924857981801033, 0.192061918258667, 0.19175924503803254, 0.19188461339473725, 0.19151564735174179, 0.19173736560344695, 0.19135245913267135, 0.1918862590789795, 0.19151189863681795, 0.19133041614294052, 0.191330322265625, 0.19150778532028198, 0.19132102805376053, 0.19126039403676987, 0.19117372441291808]}