Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 3, 160, 168,  0                                            
__________________________________________________________________________________________________
conv3d_17 (Conv3D)              (None, 1, 80, 84, 64 1792        encoded_input[0][0]              
__________________________________________________________________________________________________
conv3d_18 (Conv3D)              (None, 1, 40, 42, 64 36928       conv3d_17[0][0]                  
__________________________________________________________________________________________________
conv3d_19 (Conv3D)              (None, 1, 20, 21, 64 36928       conv3d_18[0][0]                  
__________________________________________________________________________________________________
conv3d_20 (Conv3D)              (None, 1, 10, 11, 64 36928       conv3d_19[0][0]                  
__________________________________________________________________________________________________
reshape_9 (Reshape)             (None, 7040)         0           conv3d_20[0][0]                  
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 512)          3604992     reshape_9[0][0]                  
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 512)          262656      dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 512)          262656      dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 512)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 4,242,880
Trainable params: 4,242,880
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 512)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 7040)              3611520   
_________________________________________________________________
reshape_10 (Reshape)         (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_21 (Conv3DT (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_22 (Conv3DT (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_23 (Conv3DT (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_24 (Conv3DT (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_25 (Conv3DT (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_5 (Cropping3D)    (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 3,834,689
Trainable params: 3,834,689
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              [(None, 512), (None, 512) 4242880   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    3834689   
=================================================================
Total params: 8,077,569
Trainable params: 8,077,569
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.2141604106426239, 0.17434521532058717, 0.16597787034511566, 0.15927149653434752, 0.15473085570335388, 0.15522715198993683, 0.14687149024009705, 0.151556480884552, 0.1448831350803375, 0.14809586095809937], 'loss': [0.5098095009326935, 0.19220780181884767, 0.1734778304696083, 0.16396639615297318, 0.1592885414659977, 0.15769092285633088, 0.1548230448961258, 0.15275243294239044, 0.15040132200717926, 0.1496276276409626]}