Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 309, 84, 1)   0                                            
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 155, 42, 64)  640         encoded_input[0][0]              
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 78, 21, 64)   36928       conv2d_13[0][0]                  
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 39, 11, 64)   36928       conv2d_14[0][0]                  
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 20, 6, 64)    36928       conv2d_15[0][0]                  
__________________________________________________________________________________________________
reshape_7 (Reshape)             (None, 7680)         0           conv2d_16[0][0]                  
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 512)          3932672     reshape_7[0][0]                  
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 128)          65664       dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 128)          65664       dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 128)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 4,175,424
Trainable params: 4,175,424
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 128)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 7680)              990720    
_________________________________________________________________
reshape_8 (Reshape)          (None, 20, 6, 64)         0         
_________________________________________________________________
conv2d_transpose_16 (Conv2DT (None, 40, 12, 64)        36928     
_________________________________________________________________
conv2d_transpose_17 (Conv2DT (None, 80, 24, 64)        36928     
_________________________________________________________________
conv2d_transpose_18 (Conv2DT (None, 160, 48, 64)       36928     
_________________________________________________________________
conv2d_transpose_19 (Conv2DT (None, 320, 96, 64)       36928     
_________________________________________________________________
conv2d_transpose_20 (Conv2DT (None, 320, 96, 1)        577       
_________________________________________________________________
cropping2d_4 (Cropping2D)    (None, 309, 84, 1)        0         
_________________________________________________________________
decoder_output (Activation)  (None, 309, 84, 1)        0         
=================================================================
Total params: 1,139,009
Trainable params: 1,139,009
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
encoder (Model)              [(None, 128), (None, 128) 4175424   
_________________________________________________________________
decoder (Model)              (None, 309, 84, 1)        1139009   
=================================================================
Total params: 5,314,433
Trainable params: 5,314,433
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.011151012620992131, 0.008832873995933268, 0.007533537571628888, 0.006586326915356848, 0.006152161674367057, 0.005996079362101025, 0.005872866585850716, 0.005510446385790904, 0.0056061480918692215, 0.00511824832815263, 0.004990011743373341, 0.005184256196435955, 0.004927067872550752, 0.0048563822234670324, 0.0047434989838964405, 0.004471881753868527, 0.004317360021587875, 0.004793010399573379, 0.004270396759319637, 0.004286265927884314], 'loss': [0.05185271558662256, 0.00952482237894502, 0.008320170384314325, 0.007426029317494896, 0.006745024853282504, 0.0065405854748355014, 0.006134950397018757, 0.005851086969487369, 0.005650384215534561, 0.005481326346699562, 0.005242650893309878, 0.005226206772753762, 0.004987448447694381, 0.004902402235505482, 0.0048353908526607686, 0.00468913063303464, 0.004633909487682912, 0.0044833619851205085, 0.004498342090389794, 0.0046548792683622905]}