Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 309, 84, 1)   0                                            
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 155, 42, 64)  640         encoded_input[0][0]              
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 78, 21, 64)   36928       conv2d_9[0][0]                   
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 39, 11, 64)   36928       conv2d_10[0][0]                  
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 20, 6, 64)    36928       conv2d_11[0][0]                  
__________________________________________________________________________________________________
reshape_5 (Reshape)             (None, 7680)         0           conv2d_12[0][0]                  
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 512)          3932672     reshape_5[0][0]                  
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 128)          65664       dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 128)          65664       dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 128)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 4,175,424
Trainable params: 4,175,424
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 128)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 7680)              990720    
_________________________________________________________________
reshape_6 (Reshape)          (None, 20, 6, 64)         0         
_________________________________________________________________
conv2d_transpose_11 (Conv2DT (None, 40, 12, 64)        36928     
_________________________________________________________________
conv2d_transpose_12 (Conv2DT (None, 80, 24, 64)        36928     
_________________________________________________________________
conv2d_transpose_13 (Conv2DT (None, 160, 48, 64)       36928     
_________________________________________________________________
conv2d_transpose_14 (Conv2DT (None, 320, 96, 64)       36928     
_________________________________________________________________
conv2d_transpose_15 (Conv2DT (None, 320, 96, 1)        577       
_________________________________________________________________
cropping2d_3 (Cropping2D)    (None, 309, 84, 1)        0         
_________________________________________________________________
decoder_output (Activation)  (None, 309, 84, 1)        0         
=================================================================
Total params: 1,139,009
Trainable params: 1,139,009
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
encoder (Model)              [(None, 128), (None, 128) 4175424   
_________________________________________________________________
decoder (Model)              (None, 309, 84, 1)        1139009   
=================================================================
Total params: 5,314,433
Trainable params: 5,314,433
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.010527029418283039, 0.008755293380883005, 0.007401530813011858, 0.007110341534846359, 0.006332509006477065, 0.006024484717183643, 0.005486413068655464, 0.005443049098054568, 0.005170712781449159, 0.005107384593122535, 0.005354510109043783, 0.004719292894005776, 0.004668149339656035, 0.004824231560859415, 0.0046010779216885565, 0.004774105677174198, 0.0043931754078302115, 0.0042573579545650215, 0.0045406400660673776, 0.004517929671953122], 'loss': [0.05572346741747525, 0.009698351100087165, 0.008229175108588404, 0.007373252934258845, 0.00694991083505253, 0.0065198826313846645, 0.006185414717636175, 0.005782612187580929, 0.005669947237086793, 0.005438119705455998, 0.005285904258489609, 0.005149939401696126, 0.005136660891585052, 0.004930469192461007, 0.004778638509516086, 0.004704048524403738, 0.00465055659878999, 0.004625530456089311, 0.004508976557085083, 0.004489938828369809]}