Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 155, 42, 64)       640       
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 78, 21, 64)        36928     
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 39, 11, 64)        36928     
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 20, 6, 64)         36928     
_________________________________________________________________
reshape_5 (Reshape)          (None, 7680)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 512)               3932672   
_________________________________________________________________
latent_space (Dense)         (None, 128)               65664     
=================================================================
Total params: 4,109,760
Trainable params: 4,109,760
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 128)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 7680)              990720    
_________________________________________________________________
reshape_6 (Reshape)          (None, 20, 6, 64)         0         
_________________________________________________________________
conv2d_transpose_11 (Conv2DT (None, 40, 12, 64)        36928     
_________________________________________________________________
conv2d_transpose_12 (Conv2DT (None, 80, 24, 64)        36928     
_________________________________________________________________
conv2d_transpose_13 (Conv2DT (None, 160, 48, 64)       36928     
_________________________________________________________________
conv2d_transpose_14 (Conv2DT (None, 320, 96, 64)       36928     
_________________________________________________________________
conv2d_transpose_15 (Conv2DT (None, 320, 96, 1)        577       
_________________________________________________________________
cropping2d_3 (Cropping2D)    (None, 309, 84, 1)        0         
_________________________________________________________________
decoder_output (Activation)  (None, 309, 84, 1)        0         
=================================================================
Total params: 1,139,009
Trainable params: 1,139,009
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
encoder (Model)              (None, 128)               4109760   
_________________________________________________________________
decoder (Model)              (None, 309, 84, 1)        1139009   
=================================================================
Total params: 5,248,769
Trainable params: 5,248,769
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.006465019925187032, 0.003151771828221778, 0.0030446588853374123, 0.00206535971025005, 0.0018629002889307836, 0.0016510531034631033, 0.0017014391588357587, 0.0015306782466359436, 0.0014200947984742622, 0.0020433450133229294], 'loss': [0.04942043609761943, 0.004016998964749898, 0.004580902281838159, 0.0022017485671676695, 0.0017942093927801276, 0.0016085173954100659, 0.0015535712302274381, 0.0015325706646156809, 0.0017466834684213002, 0.0012479606653020407]}