Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 1, 80, 84, 64)     1792      
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 1, 40, 42, 64)     36928     
_________________________________________________________________
conv3d_3 (Conv3D)            (None, 1, 20, 21, 64)     36928     
_________________________________________________________________
conv3d_4 (Conv3D)            (None, 1, 10, 11, 64)     36928     
_________________________________________________________________
reshape_1 (Reshape)          (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 128)               901248    
_________________________________________________________________
latent_space (Dense)         (None, 32)                4128      
=================================================================
Total params: 1,017,952
Trainable params: 1,017,952
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.0799556947350502, 0.061667009979486466, 0.05642043823003769, 0.051561660587787626, 0.05423817282915115, 0.047704433411359784, 0.047053310841321944, 0.04619814333319664, 0.05291684553027153, 0.04479675358533859, 0.046999080151319504, 0.04466215407848358, 0.04366559463739395, 0.04610248503088951, 0.04263322860002518, 0.042365997403860094, 0.04255583107471466, 0.04203260084986687, 0.04145861309766769, 0.04133008486032486], 'loss': [0.32979221890866756, 0.06911793752014637, 0.06237524259090423, 0.05368366752564907, 0.050903888516128065, 0.04975042203813791, 0.04892160375416279, 0.04639158125966787, 0.04668223813921213, 0.048623408086597916, 0.0442144727408886, 0.043969155870378016, 0.044139276303350926, 0.049069536246359347, 0.04254414092749357, 0.04169713117182255, 0.04144389189779758, 0.04124340403825045, 0.040763075202703475, 0.04111829759925604]}loss_history: {'val_loss': [0.06676517885923386, 0.06358128309249877, 0.06139083409309387, 0.06084590458869934, 0.05992776101827622], 'loss': [0.07714487381279468, 0.06318504685163498, 0.060354454025626184, 0.058655724570155145, 0.05774089433252812]}