Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 1, 80, 84, 64)     1792      
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 1, 40, 42, 64)     36928     
_________________________________________________________________
conv3d_3 (Conv3D)            (None, 1, 20, 21, 64)     36928     
_________________________________________________________________
conv3d_4 (Conv3D)            (None, 1, 10, 11, 64)     36928     
_________________________________________________________________
reshape_1 (Reshape)          (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 256)               1802496   
_________________________________________________________________
latent_space (Dense)         (None, 128)               32896     
=================================================================
Total params: 1,947,968
Trainable params: 1,947,968
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.35163241052627564, 0.05883078408241272, 0.04978512269258499, 0.04675896865129471, 0.04553695145249367, 0.04325248014926911, 0.04211843943595886, 0.04098375496268272, 0.04047913137078285, 0.03979282063245773, 0.03927075406908989, 0.039018952190876005, 0.03819458705186844, 0.03932917100191116, 0.037416079178452494, 0.03796097967028618, 0.03678612747788429, 0.03700340029597282, 0.036460286736488344, 0.03585479047894478], 'loss': [0.41022461307048796, 0.1333460119366646, 0.05441234944760799, 0.049960761174559595, 0.048411104381084445, 0.04628302703052759, 0.042199012637138364, 0.04111431171000004, 0.04232992611080408, 0.03921714272350073, 0.040826858408749105, 0.037959900408983234, 0.03916734147071838, 0.03709179485589266, 0.038411934282630684, 0.036472644597291944, 0.03543730641901493, 0.034686430677771565, 0.034863614443689586, 0.034239763580262664]}loss_history: {'val_loss': [0.05398836278915405, 0.05119374442100525, 0.050533433079719546, 0.04940892368555069, 0.048959501773118974], 'loss': [0.05668643143028021, 0.04785430220514536, 0.04629975245147944, 0.045137355871498586, 0.04413980529457331]}