Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 3, 160, 168,  0                                            
__________________________________________________________________________________________________
conv3d_5 (Conv3D)               (None, 1, 80, 84, 64 1792        encoded_input[0][0]              
__________________________________________________________________________________________________
conv3d_6 (Conv3D)               (None, 1, 40, 42, 64 36928       conv3d_5[0][0]                   
__________________________________________________________________________________________________
conv3d_7 (Conv3D)               (None, 1, 20, 21, 64 36928       conv3d_6[0][0]                   
__________________________________________________________________________________________________
conv3d_8 (Conv3D)               (None, 1, 10, 11, 64 36928       conv3d_7[0][0]                   
__________________________________________________________________________________________________
reshape_3 (Reshape)             (None, 7040)         0           conv3d_8[0][0]                   
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 512)          3604992     reshape_3[0][0]                  
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 512)          262656      dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 512)          262656      dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 512)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 4,242,880
Trainable params: 4,242,880
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 512)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 7040)              3611520   
_________________________________________________________________
reshape_4 (Reshape)          (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_6 (Conv3DTr (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_7 (Conv3DTr (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_8 (Conv3DTr (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_9 (Conv3DTr (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_10 (Conv3DT (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_2 (Cropping3D)    (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 3,834,689
Trainable params: 3,834,689
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              [(None, 512), (None, 512) 4242880   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    3834689   
=================================================================
Total params: 8,077,569
Trainable params: 8,077,569
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.09154744970798492, 0.07930040806531906, 0.0710617179274559, 0.06788896995782852, 0.0665042559504509, 0.06357793164253235, 0.06113708633184433, 0.060153912246227265, 0.05868403786420822, 0.057674093902111055, 0.05676183396577835, 0.05523907595872879, 0.05477693063020706, 0.05401446634531021, 0.053279896438121796, 0.0524269517660141, 0.051639951050281525, 0.05128981763124466, 0.05063076955080032, 0.04991879403591156], 'loss': [0.24586482185125352, 0.08388808876276016, 0.07487549620866775, 0.0695295335650444, 0.06641602246463299, 0.0636430725902319, 0.061363570392131805, 0.05942514450848103, 0.057569786250591275, 0.05606848882138729, 0.054862743303179744, 0.053483414307236674, 0.05225779318809509, 0.051573941797018054, 0.05041400956362486, 0.049636590659618375, 0.04853126692771911, 0.04768489141762257, 0.04682549241185188, 0.046149571284651754]}