Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 155, 42, 64)       640       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 78, 21, 64)        36928     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 39, 11, 64)        36928     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 20, 6, 64)         36928     
_________________________________________________________________
reshape_1 (Reshape)          (None, 7680)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 512)               3932672   
_________________________________________________________________
latent_space (Dense)         (None, 128)               65664     
=================================================================
Total params: 4,109,760
Trainable params: 4,109,760
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 7680)              990720    
_________________________________________________________________
reshape_2 (Reshape)          (None, 20, 6, 64)         0         
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 40, 12, 64)        36928     
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 80, 24, 64)        36928     
_________________________________________________________________
conv2d_transpose_3 (Conv2DTr (None, 160, 48, 64)       36928     
_________________________________________________________________
conv2d_transpose_4 (Conv2DTr (None, 320, 96, 64)       36928     
_________________________________________________________________
conv2d_transpose_5 (Conv2DTr (None, 320, 96, 1)        577       
_________________________________________________________________
cropping2d_1 (Cropping2D)    (None, 309, 84, 1)        0         
_________________________________________________________________
decoder_output (Activation)  (None, 309, 84, 1)        0         
=================================================================
Total params: 1,139,009
Trainable params: 1,139,009
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
encoder (Model)              (None, 128)               4109760   
_________________________________________________________________
decoder (Model)              (None, 309, 84, 1)        1139009   
=================================================================
Total params: 5,248,769
Trainable params: 5,248,769
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.005630552225435774, 0.0033730081856871643, 0.002591890113738676, 0.002504128011253973, 0.002277618277197083, 0.0017975971878816685, 0.0015849370835348965, 0.0015663626790046693, 0.0017032502878767748, 0.0014248734324549634], 'loss': [0.050739518014403684, 0.004758958593398954, 0.0027165338513441386, 0.0024451472028158604, 0.0019396050875851263, 0.0029711576708359643, 0.001549281314170609, 0.0014118943004480873, 0.00132106720819138, 0.0014993302256334573]}