Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
conv3d_9 (Conv3D)            (None, 1, 80, 84, 64)     1792      
_________________________________________________________________
conv3d_10 (Conv3D)           (None, 1, 40, 42, 64)     36928     
_________________________________________________________________
conv3d_11 (Conv3D)           (None, 1, 20, 21, 64)     36928     
_________________________________________________________________
conv3d_12 (Conv3D)           (None, 1, 10, 11, 64)     36928     
_________________________________________________________________
reshape_5 (Reshape)          (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 256)               1802496   
_________________________________________________________________
latent_space (Dense)         (None, 128)               32896     
=================================================================
Total params: 1,947,968
Trainable params: 1,947,968
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.09346546858549118, 0.0546070596575737, 0.049404643148183824, 0.04572316545248031, 0.04374981611967087, 0.05224948805570603, 0.04146291238069534, 0.04195196881890297, 0.04017742896080017, 0.04823057544231415, 0.04080306896567345, 0.03835335254669189, 0.03831746315956116, 0.03892573601007462, 0.03830800747871399, 0.037119974970817565, 0.03682366026937962, 0.03643834662437439, 0.03603243674337864, 0.03555917501449585], 'loss': [0.36497746884822846, 0.06814828243851662, 0.057883354343473914, 0.04741569665819406, 0.045033924117684365, 0.0436685910448432, 0.045085400350391866, 0.041255122035741804, 0.03987732847034931, 0.03889545805007219, 0.03983506542816758, 0.03945721205323935, 0.03667061527818442, 0.03616065662354231, 0.03771704242751002, 0.03595540004223585, 0.035219269804656506, 0.03468790489807725, 0.034199974052608016, 0.033874913897365334]}loss_history: {'val_loss': [0.06596710586547852, 0.06167424339056015, 0.060058527946472165, 0.05863640105724335, 0.05796790593862534], 'loss': [0.07811168962717056, 0.05932002463936806, 0.056439927637577054, 0.05439936338365078, 0.052819621041417124]}