Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 1, 80, 84, 64)     1792      
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 1, 40, 42, 64)     36928     
_________________________________________________________________
conv3d_3 (Conv3D)            (None, 1, 20, 21, 64)     36928     
_________________________________________________________________
conv3d_4 (Conv3D)            (None, 1, 10, 11, 64)     36928     
_________________________________________________________________
reshape_1 (Reshape)          (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 256)               1802496   
_________________________________________________________________
latent_space (Dense)         (None, 64)                16448     
=================================================================
Total params: 1,931,520
Trainable params: 1,931,520
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.07928665298223496, 0.056354474902153014, 0.05020365062355995, 0.04905908423662186, 0.04639542353153229, 0.044263185799121856, 0.047781532257795335, 0.043039865434169766, 0.042280203104019164, 0.041567622005939484, 0.04135781690478325, 0.041543247491121295, 0.04018666228652001, 0.04047936779260635, 0.04081934213638306, 0.03939290058612824, 0.04001462608575821, 0.03868208739161491, 0.0386282114982605, 0.03898697754740715], 'loss': [0.3634636711776257, 0.06730494269728661, 0.05356675389409065, 0.04907080084830522, 0.04895735990256071, 0.044955680973827836, 0.04633186715096235, 0.049419851452112196, 0.042027437068521974, 0.04111405674368143, 0.04051782496273518, 0.04149981319904327, 0.0396630441993475, 0.039596165493130685, 0.03961657802760601, 0.03921631956100464, 0.038314396522939206, 0.0377805504873395, 0.0383855602145195, 0.036683337077498435]}loss_history: {'val_loss': [0.06343500423431396, 0.0597312821149826, 0.058504592895507815, 0.05768958121538162, 0.0565510465502739], 'loss': [0.07357772462069988, 0.057987676456570623, 0.05566201789677143, 0.05441929955780506, 0.05306577578186989]}