Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 3, 309, 84, 1 0                                            
__________________________________________________________________________________________________
conv3d_33 (Conv3D)              (None, 1, 155, 42, 6 1792        encoded_input[0][0]              
__________________________________________________________________________________________________
conv3d_34 (Conv3D)              (None, 1, 78, 21, 64 36928       conv3d_33[0][0]                  
__________________________________________________________________________________________________
conv3d_35 (Conv3D)              (None, 1, 39, 11, 64 36928       conv3d_34[0][0]                  
__________________________________________________________________________________________________
conv3d_36 (Conv3D)              (None, 1, 20, 6, 64) 36928       conv3d_35[0][0]                  
__________________________________________________________________________________________________
reshape_17 (Reshape)            (None, 7680)         0           conv3d_36[0][0]                  
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 256)          1966336     reshape_17[0][0]                 
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 128)          32896       dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 128)          32896       dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 128)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 2,144,704
Trainable params: 2,144,704
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 128)               0         
_________________________________________________________________
dense_9 (Dense)              (None, 7680)              990720    
_________________________________________________________________
reshape_18 (Reshape)         (None, 1, 20, 6, 64)      0         
_________________________________________________________________
conv3d_transpose_41 (Conv3DT (None, 1, 40, 12, 64)     36928     
_________________________________________________________________
conv3d_transpose_42 (Conv3DT (None, 1, 80, 24, 64)     36928     
_________________________________________________________________
conv3d_transpose_43 (Conv3DT (None, 1, 160, 48, 64)    36928     
_________________________________________________________________
conv3d_transpose_44 (Conv3DT (None, 3, 320, 96, 64)    110656    
_________________________________________________________________
conv3d_transpose_45 (Conv3DT (None, 3, 320, 96, 1)     1729      
_________________________________________________________________
cropping3d_9 (Cropping3D)    (None, 3, 309, 84, 1)     0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 309, 84, 1)     0         
=================================================================
Total params: 1,213,889
Trainable params: 1,213,889
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 309, 84, 1)     0         
_________________________________________________________________
encoder (Model)              [(None, 128), (None, 128) 2144704   
_________________________________________________________________
decoder (Model)              (None, 3, 309, 84, 1)     1213889   
=================================================================
Total params: 3,358,593
Trainable params: 3,358,593
Non-trainable params: 0
_________________________________________________________________
