Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
conv3d_9 (Conv3D)            (None, 1, 80, 84, 64)     1792      
_________________________________________________________________
conv3d_10 (Conv3D)           (None, 1, 40, 42, 64)     36928     
_________________________________________________________________
conv3d_11 (Conv3D)           (None, 1, 20, 21, 64)     36928     
_________________________________________________________________
conv3d_12 (Conv3D)           (None, 1, 10, 11, 64)     36928     
_________________________________________________________________
reshape_5 (Reshape)          (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 256)               1802496   
_________________________________________________________________
latent_space (Dense)         (None, 64)                16448     
=================================================================
Total params: 1,931,520
Trainable params: 1,931,520
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.07251394146680831, 0.05422141328454018, 0.04949561643600464, 0.04821771773695946, 0.04570657926797867, 0.04596910694241524, 0.047469679057598115, 0.044670121848583225, 0.04273261758685112, 0.1184531397819519, 0.041633549839258197, 0.04270240852236748, 0.0434374078810215, 0.0402084718644619, 0.0406291526556015, 0.0399089742898941, 0.039874518185853955, 0.03889070504903793, 0.03997856584191322, 0.03871329852938652], 'loss': [0.31547808247804643, 0.062365746200084685, 0.05485053038597107, 0.04932347402721644, 0.046404310286045074, 0.04509208682179451, 0.046721471689641476, 0.043366273052990435, 0.042176939465105534, 0.04373420951515436, 0.044759339123964306, 0.04084057472646237, 0.04034944806993008, 0.03941947177052498, 0.038852997612208125, 0.04338350489735603, 0.038590388439595696, 0.03759344799816609, 0.037790719531476495, 0.03740232707560062]}loss_history: {'val_loss': [0.057007233023643494, 0.05505002462863922, 0.05444242650270462, 0.05347087270021439, 0.05282227998971939], 'loss': [0.05966870631277561, 0.05314400598406792, 0.05147179342806339, 0.05027660521864891, 0.04957173511385918]}