Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 160, 168, 1)  0                                            
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 80, 84, 64)   640         encoded_input[0][0]              
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 40, 42, 64)   36928       conv2d_17[0][0]                  
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 20, 21, 64)   36928       conv2d_18[0][0]                  
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 10, 11, 64)   36928       conv2d_19[0][0]                  
__________________________________________________________________________________________________
reshape_9 (Reshape)             (None, 7040)         0           conv2d_20[0][0]                  
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 1024)         7209984     reshape_9[0][0]                  
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 256)          262400      dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 256)          262400      dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 256)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 7,846,208
Trainable params: 7,846,208
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 256)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 7040)              1809280   
_________________________________________________________________
reshape_10 (Reshape)         (None, 10, 11, 64)        0         
_________________________________________________________________
conv2d_transpose_21 (Conv2DT (None, 20, 22, 64)        36928     
_________________________________________________________________
conv2d_transpose_22 (Conv2DT (None, 40, 44, 64)        36928     
_________________________________________________________________
conv2d_transpose_23 (Conv2DT (None, 80, 88, 64)        36928     
_________________________________________________________________
conv2d_transpose_24 (Conv2DT (None, 160, 176, 64)      36928     
_________________________________________________________________
conv2d_transpose_25 (Conv2DT (None, 160, 176, 1)       577       
_________________________________________________________________
cropping2d_5 (Cropping2D)    (None, 160, 168, 1)       0         
_________________________________________________________________
decoder_output (Activation)  (None, 160, 168, 1)       0         
=================================================================
Total params: 1,957,569
Trainable params: 1,957,569
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 160, 168, 1)       0         
_________________________________________________________________
encoder (Model)              [(None, 256), (None, 256) 7846208   
_________________________________________________________________
decoder (Model)              (None, 160, 168, 1)       1957569   
=================================================================
Total params: 9,803,777
Trainable params: 9,803,777
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.058145809595783554, 0.056950225830078124, 0.05610185553630193], 'loss': [0.06683040341362358, 0.05652287455896537, 0.055294777856518824]}