Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
conv3d_49 (Conv3D)           (None, 1, 80, 84, 64)     1792      
_________________________________________________________________
conv3d_50 (Conv3D)           (None, 1, 40, 42, 64)     36928     
_________________________________________________________________
conv3d_51 (Conv3D)           (None, 1, 20, 21, 64)     36928     
_________________________________________________________________
conv3d_52 (Conv3D)           (None, 1, 10, 11, 64)     36928     
_________________________________________________________________
reshape_25 (Reshape)         (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 512)               3604992   
_________________________________________________________________
latent_space (Dense)         (None, 256)               131328    
=================================================================
Total params: 3,848,896
Trainable params: 3,848,896
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 256)               0         
_________________________________________________________________
dense_13 (Dense)             (None, 7040)              1809280   
_________________________________________________________________
reshape_26 (Reshape)         (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_61 (Conv3DT (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_62 (Conv3DT (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_63 (Conv3DT (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_64 (Conv3DT (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_65 (Conv3DT (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_13 (Cropping3D)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 2,032,449
Trainable params: 2,032,449
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              (None, 256)               3848896   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    2032449   
=================================================================
Total params: 5,881,345
Trainable params: 5,881,345
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.056707093834877015, 0.05572402799129486, 0.055617354214191436, 0.053635351598262784, 0.052734711050987246], 'loss': [0.06628822800517083, 0.05327590523660183, 0.05177159624546766, 0.05068243849277496, 0.049617650434374806]}