Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 309, 84, 1)   0                                            
__________________________________________________________________________________________________
conv2d_61 (Conv2D)              (None, 155, 42, 64)  640         encoded_input[0][0]              
__________________________________________________________________________________________________
conv2d_62 (Conv2D)              (None, 78, 21, 64)   36928       conv2d_61[0][0]                  
__________________________________________________________________________________________________
conv2d_63 (Conv2D)              (None, 39, 11, 64)   36928       conv2d_62[0][0]                  
__________________________________________________________________________________________________
conv2d_64 (Conv2D)              (None, 20, 6, 64)    36928       conv2d_63[0][0]                  
__________________________________________________________________________________________________
reshape_31 (Reshape)            (None, 7680)         0           conv2d_64[0][0]                  
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 512)          3932672     reshape_31[0][0]                 
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 128)          65664       dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 128)          65664       dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 128)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 4,175,424
Trainable params: 4,175,424
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 128)               0         
_________________________________________________________________
dense_16 (Dense)             (None, 7680)              990720    
_________________________________________________________________
reshape_32 (Reshape)         (None, 20, 6, 64)         0         
_________________________________________________________________
conv2d_transpose_76 (Conv2DT (None, 40, 12, 64)        36928     
_________________________________________________________________
conv2d_transpose_77 (Conv2DT (None, 80, 24, 64)        36928     
_________________________________________________________________
conv2d_transpose_78 (Conv2DT (None, 160, 48, 64)       36928     
_________________________________________________________________
conv2d_transpose_79 (Conv2DT (None, 320, 96, 64)       36928     
_________________________________________________________________
conv2d_transpose_80 (Conv2DT (None, 320, 96, 1)        577       
_________________________________________________________________
cropping2d_16 (Cropping2D)   (None, 309, 84, 1)        0         
_________________________________________________________________
decoder_output (Activation)  (None, 309, 84, 1)        0         
=================================================================
Total params: 1,139,009
Trainable params: 1,139,009
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
encoder (Model)              [(None, 128), (None, 128) 4175424   
_________________________________________________________________
decoder (Model)              (None, 309, 84, 1)        1139009   
=================================================================
Total params: 5,314,433
Trainable params: 5,314,433
Non-trainable params: 0
_________________________________________________________________
