Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
conv3d_29 (Conv3D)           (None, 1, 80, 84, 64)     1792      
_________________________________________________________________
conv3d_30 (Conv3D)           (None, 1, 40, 42, 64)     36928     
_________________________________________________________________
conv3d_31 (Conv3D)           (None, 1, 20, 21, 64)     36928     
_________________________________________________________________
conv3d_32 (Conv3D)           (None, 1, 10, 11, 64)     36928     
_________________________________________________________________
reshape_15 (Reshape)         (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 1024)              7209984   
_________________________________________________________________
latent_space (Dense)         (None, 512)               524800    
=================================================================
Total params: 7,847,360
Trainable params: 7,847,360
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 512)               0         
_________________________________________________________________
dense_8 (Dense)              (None, 7040)              3611520   
_________________________________________________________________
reshape_16 (Reshape)         (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_36 (Conv3DT (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_37 (Conv3DT (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_38 (Conv3DT (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_39 (Conv3DT (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_40 (Conv3DT (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_8 (Cropping3D)    (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 3,834,689
Trainable params: 3,834,689
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              (None, 512)               7847360   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    3834689   
=================================================================
Total params: 11,682,049
Trainable params: 11,682,049
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.05580247521400452, 0.05450362092256546, 0.05399846643209458, 0.05249907857179642, 0.05213015228509903], 'loss': [0.06092412668466568, 0.05064734034240246, 0.04929441902041435, 0.04807265228778124, 0.04731047488003969]}