Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
conv3d_17 (Conv3D)           (None, 1, 80, 84, 64)     1792      
_________________________________________________________________
conv3d_18 (Conv3D)           (None, 1, 40, 42, 64)     36928     
_________________________________________________________________
conv3d_19 (Conv3D)           (None, 1, 20, 21, 64)     36928     
_________________________________________________________________
conv3d_20 (Conv3D)           (None, 1, 10, 11, 64)     36928     
_________________________________________________________________
reshape_9 (Reshape)          (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 512)               3604992   
_________________________________________________________________
latent_space (Dense)         (None, 256)               131328    
=================================================================
Total params: 3,848,896
Trainable params: 3,848,896
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 256)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 7040)              1809280   
_________________________________________________________________
reshape_10 (Reshape)         (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_21 (Conv3DT (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_22 (Conv3DT (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_23 (Conv3DT (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_24 (Conv3DT (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_25 (Conv3DT (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_5 (Cropping3D)    (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 2,032,449
Trainable params: 2,032,449
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              (None, 256)               3848896   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    2032449   
=================================================================
Total params: 5,881,345
Trainable params: 5,881,345
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.057318239450454715, 0.05465653496980667, 0.05376428145170212, 0.053728207051754, 0.05223613041639328], 'loss': [0.061912076756358146, 0.05174460153281689, 0.049994992591440676, 0.048954440519213674, 0.04777492430061102]}