Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
conv3d_5 (Conv3D)            (None, 1, 80, 84, 64)     1792      
_________________________________________________________________
conv3d_6 (Conv3D)            (None, 1, 40, 42, 64)     36928     
_________________________________________________________________
conv3d_7 (Conv3D)            (None, 1, 20, 21, 64)     36928     
_________________________________________________________________
conv3d_8 (Conv3D)            (None, 1, 10, 11, 64)     36928     
_________________________________________________________________
reshape_3 (Reshape)          (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 256)               1802496   
_________________________________________________________________
latent_space (Dense)         (None, 128)               32896     
=================================================================
Total params: 1,947,968
Trainable params: 1,947,968
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.37743848156929016, 0.059690556168556216, 0.05093815529346466, 0.0470781429708004, 0.047133109837770464, 0.04353385624289512, 0.04444738242030144, 0.043466113448143, 0.040699105620384216, 0.040491786152124405, 0.044156020671129226, 0.03974308755993843, 0.038921611875295636, 0.03830877634882927, 0.03843049699068069, 0.03751775047183037, 0.037263103723526, 0.03704969120025635, 0.03753886607289314, 0.036575000077486035], 'loss': [0.4102082442045212, 0.12511352951824664, 0.05658509779721498, 0.049036856219172476, 0.04785680317133665, 0.04436433567106724, 0.043903322882950305, 0.042233942329883575, 0.04088867593556642, 0.04085844123363495, 0.04035924958437681, 0.038547493174672126, 0.04633417686074972, 0.03731634973734617, 0.03671201761066913, 0.036368633318692445, 0.036024158988147974, 0.035522236980497834, 0.03597898246347904, 0.03763582952320576]}loss_history: {'val_loss': [0.0653561959862709, 0.0617816047668457, 0.059635669112205504, 0.05780073231458664, 0.05719406968355179], 'loss': [0.08017719420790673, 0.05948258525133133, 0.056588666304945946, 0.0545963281840086, 0.05298692937195301]}