Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 3, 160, 168,  0                                            
__________________________________________________________________________________________________
conv3d_1 (Conv3D)               (None, 1, 80, 84, 64 1792        encoded_input[0][0]              
__________________________________________________________________________________________________
conv3d_2 (Conv3D)               (None, 1, 40, 42, 64 36928       conv3d_1[0][0]                   
__________________________________________________________________________________________________
conv3d_3 (Conv3D)               (None, 1, 20, 21, 64 36928       conv3d_2[0][0]                   
__________________________________________________________________________________________________
conv3d_4 (Conv3D)               (None, 1, 10, 11, 64 36928       conv3d_3[0][0]                   
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 7040)         0           conv3d_4[0][0]                   
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 512)          3604992     reshape_1[0][0]                  
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 512)          262656      dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 512)          262656      dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 512)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 4,242,880
Trainable params: 4,242,880
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 512)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 7040)              3611520   
_________________________________________________________________
reshape_2 (Reshape)          (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_1 (Conv3DTr (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_2 (Conv3DTr (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_3 (Conv3DTr (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_4 (Conv3DTr (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_5 (Conv3DTr (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_1 (Cropping3D)    (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 3,834,689
Trainable params: 3,834,689
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              [(None, 512), (None, 512) 4242880   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    3834689   
=================================================================
Total params: 8,077,569
Trainable params: 8,077,569
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.09037427949905395, 0.07614976143836975, 0.07061781692504883, 0.06756932359933854, 0.06465431243181229, 0.06281791526079178, 0.06083776330947876, 0.05983589315414429, 0.058744146883487704, 0.05753695142269134, 0.057092254579067234, 0.05556522554159164, 0.05507170104980469, 0.053890996396541595, 0.05438906538486481, 0.05245140141248703, 0.052236759781837463, 0.05181536847352981, 0.05060110515356064, 0.04955137461423874], 'loss': [0.27712569972872736, 0.08356141777336598, 0.07396772766113281, 0.06910957482457161, 0.065395397529006, 0.06278128106892109, 0.06074956746399403, 0.05888250669836998, 0.057278122633695604, 0.05576089656352997, 0.05446171583235264, 0.05323418530076742, 0.05230782991647721, 0.05135360373556614, 0.05051858066022396, 0.04949201253056526, 0.04856945493072271, 0.04781615355610847, 0.04678534833341837, 0.045783974662423135]}