Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 155, 42, 64)       640       
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 78, 21, 64)        36928     
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 39, 11, 64)        36928     
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 20, 6, 64)         36928     
_________________________________________________________________
reshape_5 (Reshape)          (None, 7680)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 256)               1966336   
_________________________________________________________________
latent_space (Dense)         (None, 64)                16448     
=================================================================
Total params: 2,094,208
Trainable params: 2,094,208
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 64)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 7680)              499200    
_________________________________________________________________
reshape_6 (Reshape)          (None, 20, 6, 64)         0         
_________________________________________________________________
conv2d_transpose_11 (Conv2DT (None, 40, 12, 64)        36928     
_________________________________________________________________
conv2d_transpose_12 (Conv2DT (None, 80, 24, 64)        36928     
_________________________________________________________________
conv2d_transpose_13 (Conv2DT (None, 160, 48, 64)       36928     
_________________________________________________________________
conv2d_transpose_14 (Conv2DT (None, 320, 96, 64)       36928     
_________________________________________________________________
conv2d_transpose_15 (Conv2DT (None, 320, 96, 1)        577       
_________________________________________________________________
cropping2d_3 (Cropping2D)    (None, 309, 84, 1)        0         
_________________________________________________________________
decoder_output (Activation)  (None, 309, 84, 1)        0         
=================================================================
Total params: 647,489
Trainable params: 647,489
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
encoder (Model)              (None, 64)                2094208   
_________________________________________________________________
decoder (Model)              (None, 309, 84, 1)        647489    
=================================================================
Total params: 2,741,697
Trainable params: 2,741,697
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.00995065424591303, 0.005603303307046493, 0.004664898660654823, 0.0038652971945703028, 0.0033860233379527926, 0.0030870735614250103, 0.002813778199876348, 0.0029722433909773827, 0.0028785616407791775, 0.002368267161461214], 'loss': [0.0740534354854996, 0.006879142813074092, 0.004605301797079543, 0.004009722720365971, 0.003343547689340388, 0.0031000585046907264, 0.0028440011688508093, 0.002656777927962442, 0.0025620802697570375, 0.0023174562798036883]}