Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
conv3d_5 (Conv3D)            (None, 1, 80, 84, 64)     1792      
_________________________________________________________________
conv3d_6 (Conv3D)            (None, 1, 40, 42, 64)     36928     
_________________________________________________________________
conv3d_7 (Conv3D)            (None, 1, 20, 21, 64)     36928     
_________________________________________________________________
conv3d_8 (Conv3D)            (None, 1, 10, 11, 64)     36928     
_________________________________________________________________
reshape_3 (Reshape)          (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 256)               1802496   
_________________________________________________________________
latent_space (Dense)         (None, 64)                16448     
=================================================================
Total params: 1,931,520
Trainable params: 1,931,520
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.07508099150657654, 0.058585560470819475, 0.07959343487024308, 0.04866348257660866, 0.04676843547821045, 0.04572372645139694, 0.04553715243935585, 0.0439460269510746, 0.04317482054233551, 0.043411597669124606, 0.04275975331664086, 0.04216934585571289, 0.05019581273198128, 0.04175975450873375, 0.04201611763238907, 0.040452235370874404, 0.03983828043937683, 0.04025676247477532, 0.04030925339460373, 0.04050996121764183], 'loss': [0.2978494646251202, 0.06962883172929286, 0.055433999300003055, 0.052451036527752876, 0.048142109751701356, 0.04634892392903566, 0.04664684548228979, 0.04469962834566832, 0.0431607821136713, 0.04342150720953941, 0.04216446103900671, 0.043422080628573896, 0.04223618724197149, 0.04140149971097708, 0.0400543571934104, 0.03961429579555988, 0.03915125781297684, 0.03928860063105822, 0.03905795083940029, 0.04105467947944999]}loss_history: {'val_loss': [0.05898519629240036, 0.057177815198898314, 0.05668511360883713, 0.055188630759716036, 0.055139935851097104], 'loss': [0.06390645532310009, 0.05525333839654922, 0.05339359712600708, 0.052349842101335524, 0.05143012172728777]}