Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
conv3d_21 (Conv3D)           (None, 1, 80, 84, 64)     1792      
_________________________________________________________________
conv3d_22 (Conv3D)           (None, 1, 40, 42, 64)     36928     
_________________________________________________________________
conv3d_23 (Conv3D)           (None, 1, 20, 21, 64)     36928     
_________________________________________________________________
conv3d_24 (Conv3D)           (None, 1, 10, 11, 64)     36928     
_________________________________________________________________
reshape_11 (Reshape)         (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 1024)              7209984   
_________________________________________________________________
latent_space (Dense)         (None, 512)               524800    
=================================================================
Total params: 7,847,360
Trainable params: 7,847,360
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 512)               0         
_________________________________________________________________
dense_6 (Dense)              (None, 7040)              3611520   
_________________________________________________________________
reshape_12 (Reshape)         (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_26 (Conv3DT (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_27 (Conv3DT (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_28 (Conv3DT (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_29 (Conv3DT (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_30 (Conv3DT (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_6 (Cropping3D)    (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 3,834,689
Trainable params: 3,834,689
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              (None, 512)               7847360   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    3834689   
=================================================================
Total params: 11,682,049
Trainable params: 11,682,049
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.05574843871593475, 0.053949972569942474, 0.05313884049654007, 0.05330764901638031, 0.05146130645275116], 'loss': [0.061980709791183475, 0.05053789704293012, 0.04930866311490536, 0.04780023936927318, 0.04681576433032751]}