Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 3, 160, 168,  0                                            
__________________________________________________________________________________________________
conv3d_1 (Conv3D)               (None, 1, 80, 84, 64 1792        encoded_input[0][0]              
__________________________________________________________________________________________________
conv3d_2 (Conv3D)               (None, 1, 40, 42, 64 36928       conv3d_1[0][0]                   
__________________________________________________________________________________________________
conv3d_3 (Conv3D)               (None, 1, 20, 21, 64 36928       conv3d_2[0][0]                   
__________________________________________________________________________________________________
conv3d_4 (Conv3D)               (None, 1, 10, 11, 64 36928       conv3d_3[0][0]                   
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 7040)         0           conv3d_4[0][0]                   
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 512)          3604992     reshape_1[0][0]                  
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 512)          262656      dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 512)          262656      dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 512)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 4,242,880
Trainable params: 4,242,880
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 512)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 7040)              3611520   
_________________________________________________________________
reshape_2 (Reshape)          (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_1 (Conv3DTr (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_2 (Conv3DTr (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_3 (Conv3DTr (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_4 (Conv3DTr (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_5 (Conv3DTr (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_1 (Cropping3D)    (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 3,834,689
Trainable params: 3,834,689
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              [(None, 512), (None, 512) 4242880   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    3834689   
=================================================================
Total params: 8,077,569
Trainable params: 8,077,569
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.13578943049907685, 0.11886472249031067, 0.1097614815235138, 0.10762346982955932, 0.10361500298976899, 0.10155430805683135, 0.10085787743330002, 0.09856392705440521, 0.09525090050697327, 0.09562463170289993], 'loss': [0.32407368659973146, 0.12715790501236915, 0.11556067830324172, 0.10997631981968879, 0.10703699433803558, 0.10397877869009972, 0.10078017887473106, 0.09944526374340057, 0.0976772303879261, 0.0970625485777855]}