Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 309, 84, 1)     0         
_________________________________________________________________
conv3d_29 (Conv3D)           (None, 1, 155, 42, 64)    1792      
_________________________________________________________________
conv3d_30 (Conv3D)           (None, 1, 78, 21, 64)     36928     
_________________________________________________________________
conv3d_31 (Conv3D)           (None, 1, 39, 11, 64)     36928     
_________________________________________________________________
conv3d_32 (Conv3D)           (None, 1, 20, 6, 64)      36928     
_________________________________________________________________
reshape_15 (Reshape)         (None, 7680)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 512)               3932672   
_________________________________________________________________
latent_space (Dense)         (None, 256)               131328    
=================================================================
Total params: 4,176,576
Trainable params: 4,176,576
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 256)               0         
_________________________________________________________________
dense_8 (Dense)              (None, 7680)              1973760   
_________________________________________________________________
reshape_16 (Reshape)         (None, 1, 20, 6, 64)      0         
_________________________________________________________________
conv3d_transpose_36 (Conv3DT (None, 1, 40, 12, 64)     36928     
_________________________________________________________________
conv3d_transpose_37 (Conv3DT (None, 1, 80, 24, 64)     36928     
_________________________________________________________________
conv3d_transpose_38 (Conv3DT (None, 1, 160, 48, 64)    36928     
_________________________________________________________________
conv3d_transpose_39 (Conv3DT (None, 3, 320, 96, 64)    110656    
_________________________________________________________________
conv3d_transpose_40 (Conv3DT (None, 3, 320, 96, 1)     1729      
_________________________________________________________________
cropping3d_8 (Cropping3D)    (None, 3, 309, 84, 1)     0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 309, 84, 1)     0         
=================================================================
Total params: 2,196,929
Trainable params: 2,196,929
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 309, 84, 1)     0         
_________________________________________________________________
encoder (Model)              (None, 256)               4176576   
_________________________________________________________________
decoder (Model)              (None, 3, 309, 84, 1)     2196929   
=================================================================
Total params: 6,373,505
Trainable params: 6,373,505
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.006716526877135039, 0.0059966927208006384, 0.005116558590282996, 0.004782654543717702, 0.0047521884615222615], 'loss': [0.00970421390918394, 0.006541386721655726, 0.005602457278097669, 0.0049161642137914895, 0.0047159541274110475]}loss_history: {'val_loss': [0.004286677092313767, 0.0040883177767197295, 0.003954990990459919, 0.0038354631140828134, 0.003920307401567697], 'loss': [0.007705239956267178, 0.004182040573408206, 0.004020855044946075, 0.0038916923478245734, 0.0038638996348405877]}