Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 155, 42, 64)       640       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 78, 21, 64)        36928     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 39, 11, 64)        36928     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 20, 6, 64)         36928     
_________________________________________________________________
reshape_1 (Reshape)          (None, 7680)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 512)               3932672   
_________________________________________________________________
latent_space (Dense)         (None, 128)               65664     
=================================================================
Total params: 4,109,760
Trainable params: 4,109,760
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.0015445889695547522, 0.0015166671954405804, 0.0017726111753533283, 0.0015028042625635863, 0.0014882114017382264, 0.0014478756797810396, 0.001659018557984382, 0.001367457154362152, 0.0014966063814548154, 0.00141800637744988], 'loss': [0.0016478542156983167, 0.001419990460659998, 0.0015345176031890636, 0.0014152123864429693, 0.001326094073204634, 0.001347958746094567, 0.0012950016371905803, 0.0012717888890377556, 0.0012348280697672938, 0.001277169153521148]}