Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 3, 160, 168,  0                                            
__________________________________________________________________________________________________
conv3d_49 (Conv3D)              (None, 1, 80, 84, 64 1792        encoded_input[0][0]              
__________________________________________________________________________________________________
conv3d_50 (Conv3D)              (None, 1, 40, 42, 64 36928       conv3d_49[0][0]                  
__________________________________________________________________________________________________
conv3d_51 (Conv3D)              (None, 1, 20, 21, 64 36928       conv3d_50[0][0]                  
__________________________________________________________________________________________________
conv3d_52 (Conv3D)              (None, 1, 10, 11, 64 36928       conv3d_51[0][0]                  
__________________________________________________________________________________________________
reshape_25 (Reshape)            (None, 7040)         0           conv3d_52[0][0]                  
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 512)          3604992     reshape_25[0][0]                 
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 512)          262656      dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 512)          262656      dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 512)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 4,242,880
Trainable params: 4,242,880
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 512)               0         
_________________________________________________________________
dense_13 (Dense)             (None, 7040)              3611520   
_________________________________________________________________
reshape_26 (Reshape)         (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_61 (Conv3DT (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_62 (Conv3DT (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_63 (Conv3DT (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_64 (Conv3DT (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_65 (Conv3DT (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_13 (Cropping3D)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 3,834,689
Trainable params: 3,834,689
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              [(None, 512), (None, 512) 4242880   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    3834689   
=================================================================
Total params: 8,077,569
Trainable params: 8,077,569
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.04192323714494705, 0.042007753282785415, 0.04205650243163109, 0.041357267588376996, 0.041704131424427034, 0.04147188326716423, 0.04699961149692535, 0.041298685163259505, 0.041133111447095874, 0.04083689120411873], 'loss': [0.04044345167279244, 0.04029840326309204, 0.039918387338519094, 0.03967370811104774, 0.03921760529279709, 0.03915333631634712, 0.039161121927201746, 0.03923579370975495, 0.0388185026049614, 0.03827354397624731]}loss_history: {'val_loss': [0.0668969606757164, 0.06461323326826096, 0.0631704556941986, 0.06206219685077667, 0.0618590789437294], 'loss': [0.07668748033046723, 0.061999808579683305, 0.060345030784606936, 0.05903700961172581, 0.058140200719237325]}loss_history: {'val_loss': [0.06195872014760971, 0.06079760217666626, 0.060372092366218565, 0.05994754856824875, 0.05959696567058563], 'loss': [0.05795426446199417, 0.05717027392983436, 0.05647672873735428, 0.056120951786637306, 0.05589702704548836]}loss_history: {'val_loss': [0.05876168429851532, 0.058074202597141265, 0.05781248706579208, 0.05804871392250061, 0.057718682527542114], 'loss': [0.05435498277842998, 0.05367987383902073, 0.053312993504106995, 0.05320114372670651, 0.052933683030307294]}