Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 3, 160, 168,  0                                            
__________________________________________________________________________________________________
conv3d_17 (Conv3D)              (None, 1, 80, 84, 64 1792        encoded_input[0][0]              
__________________________________________________________________________________________________
conv3d_18 (Conv3D)              (None, 1, 40, 42, 64 36928       conv3d_17[0][0]                  
__________________________________________________________________________________________________
conv3d_19 (Conv3D)              (None, 1, 20, 21, 64 36928       conv3d_18[0][0]                  
__________________________________________________________________________________________________
conv3d_20 (Conv3D)              (None, 1, 10, 11, 64 36928       conv3d_19[0][0]                  
__________________________________________________________________________________________________
reshape_9 (Reshape)             (None, 7040)         0           conv3d_20[0][0]                  
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 512)          3604992     reshape_9[0][0]                  
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 512)          262656      dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 512)          262656      dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 512)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 4,242,880
Trainable params: 4,242,880
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 512)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 7040)              3611520   
_________________________________________________________________
reshape_10 (Reshape)         (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_21 (Conv3DT (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_22 (Conv3DT (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_23 (Conv3DT (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_24 (Conv3DT (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_25 (Conv3DT (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_5 (Cropping3D)    (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 3,834,689
Trainable params: 3,834,689
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              [(None, 512), (None, 512) 4242880   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    3834689   
=================================================================
Total params: 8,077,569
Trainable params: 8,077,569
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.09014166080951691, 0.07776043128967285, 0.07072659796476365, 0.06769060438871384, 0.06574252879619598, 0.06211733680963516, 0.06128127384185791, 0.05952081197500229, 0.05816496521234513, 0.05697069066762924, 0.056096670389175415, 0.05538836419582367, 0.05450852108001709, 0.05372402483224869, 0.05314552539587021, 0.05247720068693161, 0.052239493012428286, 0.05136658358573914, 0.050724590957164764, 0.04984805119037628], 'loss': [0.26298471352458, 0.08309893946349621, 0.07344129064679146, 0.0687497346252203, 0.06556766338646412, 0.06252714954316616, 0.06039770545065403, 0.05853010496497154, 0.05657941107451916, 0.055392717003822325, 0.05415432944893837, 0.0530507021099329, 0.051974184274673464, 0.050975569546222683, 0.05008865945786238, 0.049380209445953366, 0.048521888330578807, 0.0476915797367692, 0.046898303098976614, 0.045919175870716575]}