Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 155, 42, 64)       640       
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 78, 21, 64)        36928     
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 39, 11, 64)        36928     
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 20, 6, 64)         36928     
_________________________________________________________________
reshape_5 (Reshape)          (None, 7680)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 512)               3932672   
_________________________________________________________________
latent_space (Dense)         (None, 128)               65664     
=================================================================
Total params: 4,109,760
Trainable params: 4,109,760
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.011659880205988883, 0.005408080837999781, 0.004428299162536859, 0.004179060732324918, 0.0033480259279410046, 0.0033889902258912724, 0.00299927424484243, 0.0027194490920131407, 0.002655207213635246, 0.0025672661528612175], 'loss': [0.08880265893414617, 0.007024207449673365, 0.004723715124030908, 0.0040146043943241234, 0.0035328471870161595, 0.0031191529364635547, 0.0028989201978159448, 0.0027872008768220742, 0.0024827940692193806, 0.002368740822809438]}