Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 160, 168, 1)       0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 80, 84, 64)        640       
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 40, 42, 64)        36928     
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 20, 21, 64)        36928     
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 10, 11, 64)        36928     
_________________________________________________________________
reshape_3 (Reshape)          (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 512)               3604992   
_________________________________________________________________
latent_space (Dense)         (None, 128)               65664     
=================================================================
Total params: 3,782,080
Trainable params: 3,782,080
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 7040)              908160    
_________________________________________________________________
reshape_4 (Reshape)          (None, 10, 11, 64)        0         
_________________________________________________________________
conv2d_transpose_6 (Conv2DTr (None, 20, 22, 64)        36928     
_________________________________________________________________
conv2d_transpose_7 (Conv2DTr (None, 40, 44, 64)        36928     
_________________________________________________________________
conv2d_transpose_8 (Conv2DTr (None, 80, 88, 64)        36928     
_________________________________________________________________
conv2d_transpose_9 (Conv2DTr (None, 160, 176, 64)      36928     
_________________________________________________________________
conv2d_transpose_10 (Conv2DT (None, 160, 176, 1)       577       
_________________________________________________________________
cropping2d_2 (Cropping2D)    (None, 160, 168, 1)       0         
_________________________________________________________________
decoder_output (Activation)  (None, 160, 168, 1)       0         
=================================================================
Total params: 1,056,449
Trainable params: 1,056,449
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 160, 168, 1)       0         
_________________________________________________________________
encoder (Model)              (None, 128)               3782080   
_________________________________________________________________
decoder (Model)              (None, 160, 168, 1)       1056449   
=================================================================
Total params: 4,838,529
Trainable params: 4,838,529
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 160, 168, 1)       0         
_________________________________________________________________
encoder (Model)              (None, 128)               3782080   
_________________________________________________________________
decoder (Model)              (None, 160, 168, 1)       1056449   
=================================================================
Total params: 4,838,529
Trainable params: 4,838,529
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.04419756085922321, 0.04127036074797313, 0.04001218482851982, 0.038910886868834496, 0.03780604214717945, 0.037592703551054, 0.037012874260544774, 0.03605732931445042, 0.03586627823611101, 0.035277187066773574], 'loss': [0.04990023005443315, 0.04309272362229725, 0.04059590164572, 0.03880864281207323, 0.03747397588255505, 0.03634032040523986, 0.035598752959631386, 0.0346970381323869, 0.03407088975732525, 0.03337253781656424]}