Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 1, 80, 84, 64)     1792      
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 1, 40, 42, 64)     36928     
_________________________________________________________________
conv3d_3 (Conv3D)            (None, 1, 20, 21, 64)     36928     
_________________________________________________________________
conv3d_4 (Conv3D)            (None, 1, 10, 11, 64)     36928     
_________________________________________________________________
reshape_1 (Reshape)          (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 256)               1802496   
_________________________________________________________________
latent_space (Dense)         (None, 128)               32896     
=================================================================
Total params: 1,947,968
Trainable params: 1,947,968
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.07204544293880463, 0.05709578427672386, 0.04850618702173233, 0.046759362012147906, 0.0444932481944561, 0.043191242039203645, 0.04222071528434754, 0.0416565748155117, 0.041047263473272325, 0.03992914867401123, 0.039929142892360686, 0.03918409788608551, 0.04328086447715759, 0.038376842051744464, 0.037890785992145536, 0.0376118536144495, 0.037060960426926616, 0.037149654522538184, 0.03697696016728878, 0.036880367800593374], 'loss': [0.3282732924669981, 0.06400819485634565, 0.05142608465999365, 0.0499381404966116, 0.04544171880185604, 0.04497776501625776, 0.042206074804067614, 0.04828890886157751, 0.04047131992504001, 0.03949264707416296, 0.038835400462150574, 0.038215703666210174, 0.0400413576811552, 0.04590444274991751, 0.03658854017779231, 0.03599994138255715, 0.03556519899889827, 0.03534841787442565, 0.035218315642327074, 0.03531409990042448]}loss_history: {'val_loss': [0.06461755746603012, 0.061693470060825345, 0.05954323488473892, 0.05821226352453232, 0.05667406553030014], 'loss': [0.07749580909311772, 0.0583659244030714, 0.0558088912665844, 0.054103410214185715, 0.052718618407845495]}