Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 155, 42, 64)       640       
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 78, 21, 64)        36928     
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 39, 11, 64)        36928     
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 20, 6, 64)         36928     
_________________________________________________________________
reshape_7 (Reshape)          (None, 7680)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 512)               3932672   
_________________________________________________________________
latent_space (Dense)         (None, 128)               65664     
=================================================================
Total params: 4,109,760
Trainable params: 4,109,760
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 128)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 7680)              990720    
_________________________________________________________________
reshape_8 (Reshape)          (None, 20, 6, 64)         0         
_________________________________________________________________
conv2d_transpose_16 (Conv2DT (None, 40, 12, 64)        36928     
_________________________________________________________________
conv2d_transpose_17 (Conv2DT (None, 80, 24, 64)        36928     
_________________________________________________________________
conv2d_transpose_18 (Conv2DT (None, 160, 48, 64)       36928     
_________________________________________________________________
conv2d_transpose_19 (Conv2DT (None, 320, 96, 64)       36928     
_________________________________________________________________
conv2d_transpose_20 (Conv2DT (None, 320, 96, 1)        577       
_________________________________________________________________
cropping2d_4 (Cropping2D)    (None, 309, 84, 1)        0         
_________________________________________________________________
decoder_output (Activation)  (None, 309, 84, 1)        0         
=================================================================
Total params: 1,139,009
Trainable params: 1,139,009
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
encoder (Model)              (None, 128)               4109760   
_________________________________________________________________
decoder (Model)              (None, 309, 84, 1)        1139009   
=================================================================
Total params: 5,248,769
Trainable params: 5,248,769
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.006449290302892526, 0.0047080763336271045, 0.002496728259138763, 0.004269662623604138, 0.0018316655016193787, 0.0016395674839926263, 0.001547633840236813, 0.0014475874129372338, 0.001844783880903075, 0.0013595137077694137], 'loss': [0.05683660825481638, 0.003968546960192422, 0.0028864139906363564, 0.002258241832217512, 0.002520657101801286, 0.0016297775929948936, 0.0015733722139460345, 0.0014397327539821467, 0.0015727819995178531, 0.001490122450243992]}