Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 309, 84, 1)     0         
_________________________________________________________________
conv3d_21 (Conv3D)           (None, 1, 155, 42, 64)    1792      
_________________________________________________________________
conv3d_22 (Conv3D)           (None, 1, 78, 21, 64)     36928     
_________________________________________________________________
conv3d_23 (Conv3D)           (None, 1, 39, 11, 64)     36928     
_________________________________________________________________
conv3d_24 (Conv3D)           (None, 1, 20, 6, 64)      36928     
_________________________________________________________________
reshape_11 (Reshape)         (None, 7680)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 1024)              7865344   
_________________________________________________________________
latent_space (Dense)         (None, 512)               524800    
=================================================================
Total params: 8,502,720
Trainable params: 8,502,720
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 512)               0         
_________________________________________________________________
dense_6 (Dense)              (None, 7680)              3939840   
_________________________________________________________________
reshape_12 (Reshape)         (None, 1, 20, 6, 64)      0         
_________________________________________________________________
conv3d_transpose_26 (Conv3DT (None, 1, 40, 12, 64)     36928     
_________________________________________________________________
conv3d_transpose_27 (Conv3DT (None, 1, 80, 24, 64)     36928     
_________________________________________________________________
conv3d_transpose_28 (Conv3DT (None, 1, 160, 48, 64)    36928     
_________________________________________________________________
conv3d_transpose_29 (Conv3DT (None, 3, 320, 96, 64)    110656    
_________________________________________________________________
conv3d_transpose_30 (Conv3DT (None, 3, 320, 96, 1)     1729      
_________________________________________________________________
cropping3d_6 (Cropping3D)    (None, 3, 309, 84, 1)     0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 309, 84, 1)     0         
=================================================================
Total params: 4,163,009
Trainable params: 4,163,009
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 309, 84, 1)     0         
_________________________________________________________________
encoder (Model)              (None, 512)               8502720   
_________________________________________________________________
decoder (Model)              (None, 3, 309, 84, 1)     4163009   
=================================================================
Total params: 12,665,729
Trainable params: 12,665,729
Non-trainable params: 0
_________________________________________________________________
