Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 160, 168, 1)  0                                            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 80, 84, 64)   640         encoded_input[0][0]              
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 40, 42, 64)   36928       conv2d_5[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 20, 21, 64)   36928       conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 10, 11, 64)   36928       conv2d_7[0][0]                   
__________________________________________________________________________________________________
reshape_3 (Reshape)             (None, 7040)         0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 1024)         7209984     reshape_3[0][0]                  
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 256)          262400      dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 256)          262400      dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 256)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 7,846,208
Trainable params: 7,846,208
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 256)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 7040)              1809280   
_________________________________________________________________
reshape_4 (Reshape)          (None, 10, 11, 64)        0         
_________________________________________________________________
conv2d_transpose_6 (Conv2DTr (None, 20, 22, 64)        36928     
_________________________________________________________________
conv2d_transpose_7 (Conv2DTr (None, 40, 44, 64)        36928     
_________________________________________________________________
conv2d_transpose_8 (Conv2DTr (None, 80, 88, 64)        36928     
_________________________________________________________________
conv2d_transpose_9 (Conv2DTr (None, 160, 176, 64)      36928     
_________________________________________________________________
conv2d_transpose_10 (Conv2DT (None, 160, 176, 1)       577       
_________________________________________________________________
cropping2d_2 (Cropping2D)    (None, 160, 168, 1)       0         
_________________________________________________________________
decoder_output (Activation)  (None, 160, 168, 1)       0         
=================================================================
Total params: 1,957,569
Trainable params: 1,957,569
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 160, 168, 1)       0         
_________________________________________________________________
encoder (Model)              [(None, 256), (None, 256) 7846208   
_________________________________________________________________
decoder (Model)              (None, 160, 168, 1)       1957569   
=================================================================
Total params: 9,803,777
Trainable params: 9,803,777
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.05591126011063655, 0.05464831863840421, 0.05398616896321376], 'loss': [0.06258578116384646, 0.05342897466694315, 0.052567827124148606]}