Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
conv3d_37 (Conv3D)           (None, 1, 80, 84, 64)     1792      
_________________________________________________________________
conv3d_38 (Conv3D)           (None, 1, 40, 42, 64)     36928     
_________________________________________________________________
conv3d_39 (Conv3D)           (None, 1, 20, 21, 64)     36928     
_________________________________________________________________
conv3d_40 (Conv3D)           (None, 1, 10, 11, 64)     36928     
_________________________________________________________________
reshape_19 (Reshape)         (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 512)               3604992   
_________________________________________________________________
latent_space (Dense)         (None, 256)               131328    
=================================================================
Total params: 3,848,896
Trainable params: 3,848,896
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 256)               0         
_________________________________________________________________
dense_10 (Dense)             (None, 7040)              1809280   
_________________________________________________________________
reshape_20 (Reshape)         (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_46 (Conv3DT (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_47 (Conv3DT (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_48 (Conv3DT (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_49 (Conv3DT (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_50 (Conv3DT (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_10 (Cropping3D)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 2,032,449
Trainable params: 2,032,449
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              (None, 256)               3848896   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    2032449   
=================================================================
Total params: 5,881,345
Trainable params: 5,881,345
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.05711339861154556, 0.05507947504520416, 0.054256256461143494, 0.05316325610876083, 0.053876015186309814], 'loss': [0.06485401025414467, 0.05212920475006103, 0.0503546919003129, 0.049275556989014146, 0.0483111679404974]}