Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
conv3d_13 (Conv3D)           (None, 1, 80, 84, 64)     1792      
_________________________________________________________________
conv3d_14 (Conv3D)           (None, 1, 40, 42, 64)     36928     
_________________________________________________________________
conv3d_15 (Conv3D)           (None, 1, 20, 21, 64)     36928     
_________________________________________________________________
conv3d_16 (Conv3D)           (None, 1, 10, 11, 64)     36928     
_________________________________________________________________
reshape_7 (Reshape)          (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 256)               1802496   
_________________________________________________________________
latent_space (Dense)         (None, 128)               32896     
=================================================================
Total params: 1,947,968
Trainable params: 1,947,968
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.15987011909484863, 0.05926166015863418, 0.05017702528834343, 0.04664662283658981, 0.04515651422739029, 0.04365694120526314, 0.04275648817420006, 0.04154190322756767, 0.0415266714990139, 0.040454409390687944, 0.04230264419317246, 0.04004806563258171, 0.03903883013129234, 0.03922628176212311, 0.038600951790809634, 0.040263615697622296, 0.03736950233578682, 0.03725702808797359, 0.037014605090022086, 0.03639012983441353], 'loss': [0.39153120285272597, 0.07630555394291878, 0.05394594805687666, 0.05065411347150803, 0.050907105267047885, 0.043977222859859465, 0.042657340705394745, 0.04502440544962883, 0.04107380497455597, 0.03978586152940988, 0.041746272854506966, 0.04000539294630289, 0.03841285881400108, 0.03848755855113268, 0.037272996321320535, 0.03650869408249855, 0.036111574735492466, 0.03549814150482416, 0.03995237199962139, 0.03481995168328285]}loss_history: {'val_loss': [0.05306813818216324, 0.05166957759857178, 0.05075398975610733, 0.04954931777715683, 0.04935727316141129], 'loss': [0.05664195103943348, 0.04836815708130598, 0.046803612641990185, 0.04568152669817209, 0.044730651505291465]}