Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 3, 160, 168,  0                                            
__________________________________________________________________________________________________
conv3d_9 (Conv3D)               (None, 1, 80, 84, 64 1792        encoded_input[0][0]              
__________________________________________________________________________________________________
conv3d_10 (Conv3D)              (None, 1, 40, 42, 64 36928       conv3d_9[0][0]                   
__________________________________________________________________________________________________
conv3d_11 (Conv3D)              (None, 1, 20, 21, 64 36928       conv3d_10[0][0]                  
__________________________________________________________________________________________________
conv3d_12 (Conv3D)              (None, 1, 10, 11, 64 36928       conv3d_11[0][0]                  
__________________________________________________________________________________________________
reshape_5 (Reshape)             (None, 7040)         0           conv3d_12[0][0]                  
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 512)          3604992     reshape_5[0][0]                  
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 512)          262656      dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 512)          262656      dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 512)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 4,242,880
Trainable params: 4,242,880
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 512)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 7040)              3611520   
_________________________________________________________________
reshape_6 (Reshape)          (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_11 (Conv3DT (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_12 (Conv3DT (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_13 (Conv3DT (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_14 (Conv3DT (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_15 (Conv3DT (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_3 (Cropping3D)    (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 3,834,689
Trainable params: 3,834,689
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              [(None, 512), (None, 512) 4242880   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    3834689   
=================================================================
Total params: 8,077,569
Trainable params: 8,077,569
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.08954007297754288, 0.07574858736991882, 0.06971865153312683, 0.06618043452501297, 0.06384622275829316, 0.06093315500020981, 0.05913856989145279, 0.058210954129695895, 0.057793640196323395, 0.05620489341020584, 0.055216744184494015, 0.054579157769680024, 0.054282459795475003, 0.053118723630905154, 0.05235712891817093, 0.05155980390310287, 0.05044798791408539, 0.05036248677968979, 0.04971000662446022, 0.04953281724452972], 'loss': [0.278418435305357, 0.08140424105525017, 0.07200330162048339, 0.06701727578043938, 0.06364436022937298, 0.061317583203315734, 0.05919601739943028, 0.05729399777948856, 0.05595329827070236, 0.05460644353926182, 0.053290434300899504, 0.05217234690487385, 0.05110910865664482, 0.05029703897237778, 0.04933977479487658, 0.04834680347889662, 0.047213860213756564, 0.046260439984500405, 0.045411576062440874, 0.044665412366390225]}