Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 160, 168, 1)       0         
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 80, 84, 64)        640       
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 40, 42, 64)        36928     
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 20, 21, 64)        36928     
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 10, 11, 64)        36928     
_________________________________________________________________
reshape_9 (Reshape)          (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 512)               3604992   
_________________________________________________________________
latent_space (Dense)         (None, 128)               65664     
=================================================================
Total params: 3,782,080
Trainable params: 3,782,080
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 128)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 7040)              908160    
_________________________________________________________________
reshape_10 (Reshape)         (None, 10, 11, 64)        0         
_________________________________________________________________
conv2d_transpose_21 (Conv2DT (None, 20, 22, 64)        36928     
_________________________________________________________________
conv2d_transpose_22 (Conv2DT (None, 40, 44, 64)        36928     
_________________________________________________________________
conv2d_transpose_23 (Conv2DT (None, 80, 88, 64)        36928     
_________________________________________________________________
conv2d_transpose_24 (Conv2DT (None, 160, 176, 64)      36928     
_________________________________________________________________
conv2d_transpose_25 (Conv2DT (None, 160, 176, 1)       577       
_________________________________________________________________
cropping2d_5 (Cropping2D)    (None, 160, 168, 1)       0         
_________________________________________________________________
decoder_output (Activation)  (None, 160, 168, 1)       0         
=================================================================
Total params: 1,056,449
Trainable params: 1,056,449
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 160, 168, 1)       0         
_________________________________________________________________
encoder (Model)              (None, 128)               3782080   
_________________________________________________________________
decoder (Model)              (None, 160, 168, 1)       1056449   
=================================================================
Total params: 4,838,529
Trainable params: 4,838,529
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 160, 168, 1)       0         
_________________________________________________________________
encoder (Model)              (None, 128)               3782080   
_________________________________________________________________
decoder (Model)              (None, 160, 168, 1)       1056449   
=================================================================
Total params: 4,838,529
Trainable params: 4,838,529
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.04343602163096269, 0.04103399533778429, 0.0397042715921998, 0.03874802013238271, 0.038096337194244066, 0.036829987267653144, 0.036007678185900054, 0.03538510031998157, 0.0352925639351209, 0.034172744291524094], 'loss': [0.05016168458076815, 0.04260740709180633, 0.03972901249925295, 0.03811722664162517, 0.03661780858722826, 0.0354788828579088, 0.03462909441751738, 0.03379087985803684, 0.03298084492639949, 0.03253812029026449]}