Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 160, 168, 1)  0                                            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 80, 84, 64)   640         encoded_input[0][0]              
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 40, 42, 64)   36928       conv2d_5[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 20, 21, 64)   36928       conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 10, 11, 64)   36928       conv2d_7[0][0]                   
__________________________________________________________________________________________________
reshape_3 (Reshape)             (None, 7040)         0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 512)          3604992     reshape_3[0][0]                  
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 128)          65664       dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 128)          65664       dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 128)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 3,847,744
Trainable params: 3,847,744
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 7040)              908160    
_________________________________________________________________
reshape_4 (Reshape)          (None, 10, 11, 64)        0         
_________________________________________________________________
conv2d_transpose_6 (Conv2DTr (None, 20, 22, 64)        36928     
_________________________________________________________________
conv2d_transpose_7 (Conv2DTr (None, 40, 44, 64)        36928     
_________________________________________________________________
conv2d_transpose_8 (Conv2DTr (None, 80, 88, 64)        36928     
_________________________________________________________________
conv2d_transpose_9 (Conv2DTr (None, 160, 176, 64)      36928     
_________________________________________________________________
conv2d_transpose_10 (Conv2DT (None, 160, 176, 1)       577       
_________________________________________________________________
cropping2d_2 (Cropping2D)    (None, 160, 168, 1)       0         
_________________________________________________________________
decoder_output (Activation)  (None, 160, 168, 1)       0         
=================================================================
Total params: 1,056,449
Trainable params: 1,056,449
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 160, 168, 1)       0         
_________________________________________________________________
encoder (Model)              [(None, 128), (None, 128) 3847744   
_________________________________________________________________
decoder (Model)              (None, 160, 168, 1)       1056449   
=================================================================
Total params: 4,904,193
Trainable params: 4,904,193
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.07742799314359824, 0.0768655552715063, 0.07446820800503096], 'loss': [0.08690893653780223, 0.0773509106102089, 0.07608583994209767]}