Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 3, 160, 168,  0                                            
__________________________________________________________________________________________________
conv3d_25 (Conv3D)              (None, 1, 80, 84, 64 1792        encoded_input[0][0]              
__________________________________________________________________________________________________
conv3d_26 (Conv3D)              (None, 1, 40, 42, 64 36928       conv3d_25[0][0]                  
__________________________________________________________________________________________________
conv3d_27 (Conv3D)              (None, 1, 20, 21, 64 36928       conv3d_26[0][0]                  
__________________________________________________________________________________________________
conv3d_28 (Conv3D)              (None, 1, 10, 11, 64 36928       conv3d_27[0][0]                  
__________________________________________________________________________________________________
reshape_13 (Reshape)            (None, 7040)         0           conv3d_28[0][0]                  
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 512)          3604992     reshape_13[0][0]                 
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 512)          262656      dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 512)          262656      dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 512)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 4,242,880
Trainable params: 4,242,880
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 512)               0         
_________________________________________________________________
dense_7 (Dense)              (None, 7040)              3611520   
_________________________________________________________________
reshape_14 (Reshape)         (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_31 (Conv3DT (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_32 (Conv3DT (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_33 (Conv3DT (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_34 (Conv3DT (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_35 (Conv3DT (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_7 (Cropping3D)    (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 3,834,689
Trainable params: 3,834,689
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              [(None, 512), (None, 512) 4242880   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    3834689   
=================================================================
Total params: 8,077,569
Trainable params: 8,077,569
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.09558661806583404, 0.09249575018882751, 0.09453160238265991, 0.0895526459813118, 0.08873903357982635], 'loss': [0.10825837242603302, 0.09428929179906845, 0.09186872668564319, 0.09076078696548939, 0.0892862635999918]}