Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
conv3d_45 (Conv3D)           (None, 1, 80, 84, 64)     1792      
_________________________________________________________________
conv3d_46 (Conv3D)           (None, 1, 40, 42, 64)     36928     
_________________________________________________________________
conv3d_47 (Conv3D)           (None, 1, 20, 21, 64)     36928     
_________________________________________________________________
conv3d_48 (Conv3D)           (None, 1, 10, 11, 64)     36928     
_________________________________________________________________
reshape_23 (Reshape)         (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 1024)              7209984   
_________________________________________________________________
latent_space (Dense)         (None, 512)               524800    
=================================================================
Total params: 7,847,360
Trainable params: 7,847,360
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 512)               0         
_________________________________________________________________
dense_12 (Dense)             (None, 7040)              3611520   
_________________________________________________________________
reshape_24 (Reshape)         (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_56 (Conv3DT (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_57 (Conv3DT (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_58 (Conv3DT (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_59 (Conv3DT (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_60 (Conv3DT (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_12 (Cropping3D)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 3,834,689
Trainable params: 3,834,689
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              (None, 512)               7847360   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    3834689   
=================================================================
Total params: 11,682,049
Trainable params: 11,682,049
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.05769034487009048, 0.055514499962329864, 0.05451809984445572, 0.05321296209096909, 0.05240447247028351], 'loss': [0.06858269470930099, 0.05306697742640972, 0.050825410082936284, 0.049655819915235044, 0.048274302810430526]}