Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 160, 168, 1)       0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 80, 84, 64)        640       
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 40, 42, 64)        36928     
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 20, 21, 64)        36928     
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 10, 11, 64)        36928     
_________________________________________________________________
reshape_7 (Reshape)          (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 1024)              7209984   
_________________________________________________________________
latent_space (Dense)         (None, 256)               262400    
=================================================================
Total params: 7,583,808
Trainable params: 7,583,808
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 256)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 7040)              1809280   
_________________________________________________________________
reshape_8 (Reshape)          (None, 10, 11, 64)        0         
_________________________________________________________________
conv2d_transpose_16 (Conv2DT (None, 20, 22, 64)        36928     
_________________________________________________________________
conv2d_transpose_17 (Conv2DT (None, 40, 44, 64)        36928     
_________________________________________________________________
conv2d_transpose_18 (Conv2DT (None, 80, 88, 64)        36928     
_________________________________________________________________
conv2d_transpose_19 (Conv2DT (None, 160, 176, 64)      36928     
_________________________________________________________________
conv2d_transpose_20 (Conv2DT (None, 160, 176, 1)       577       
_________________________________________________________________
cropping2d_4 (Cropping2D)    (None, 160, 168, 1)       0         
_________________________________________________________________
decoder_output (Activation)  (None, 160, 168, 1)       0         
=================================================================
Total params: 1,957,569
Trainable params: 1,957,569
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 160, 168, 1)       0         
_________________________________________________________________
encoder (Model)              (None, 256)               7583808   
_________________________________________________________________
decoder (Model)              (None, 160, 168, 1)       1957569   
=================================================================
Total params: 9,541,377
Trainable params: 9,541,377
Non-trainable params: 0
_________________________________________________________________
