Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 155, 42, 64)       640       
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 78, 21, 64)        36928     
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 39, 11, 64)        36928     
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 20, 6, 64)         36928     
_________________________________________________________________
reshape_7 (Reshape)          (None, 7680)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 512)               3932672   
_________________________________________________________________
latent_space (Dense)         (None, 128)               65664     
=================================================================
Total params: 4,109,760
Trainable params: 4,109,760
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.001111421654932201, 0.0011514069465920328, 0.0012353774237756929, 0.0013139839253077904, 0.0013086104361961285, 0.0012195813011688492, 0.0011593770476368565, 0.001262025316245854, 0.0012178341788239776, 0.0012649968607972065], 'loss': [0.0014469296421157195, 0.0009515370719600469, 0.0010074168889938544, 0.0010359582852106542, 0.0010473864094819874, 0.0010656441752022754, 0.0010802382021211088, 0.0010204950894694776, 0.0009598535039306928, 0.0010383292522359018]}