Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
conv3d_13 (Conv3D)           (None, 1, 80, 84, 64)     1792      
_________________________________________________________________
conv3d_14 (Conv3D)           (None, 1, 40, 42, 64)     36928     
_________________________________________________________________
conv3d_15 (Conv3D)           (None, 1, 20, 21, 64)     36928     
_________________________________________________________________
conv3d_16 (Conv3D)           (None, 1, 10, 11, 64)     36928     
_________________________________________________________________
reshape_7 (Reshape)          (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 256)               1802496   
_________________________________________________________________
latent_space (Dense)         (None, 64)                16448     
=================================================================
Total params: 1,931,520
Trainable params: 1,931,520
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.07755503410100936, 0.05514616498351097, 0.05133697408437729, 0.048013665169477464, 0.04640417677164078, 0.044417762458324433, 0.04360893088579178, 0.04683040478825569, 0.04256907081604004, 0.04156573548913002, 0.04213951846957207, 0.04086573708057403, 0.04054101949930191, 0.04000096845626831, 0.0396494071483612, 0.03926384162902832, 0.044988669812679294, 0.0392872419655323, 0.038658409386873246, 0.03802578580379486], 'loss': [0.32173783437907694, 0.06367630055546761, 0.05636291867494583, 0.04900539331883192, 0.047295021340250966, 0.046334245286881924, 0.04366140069812536, 0.05701242857426405, 0.043132922366261484, 0.041389177776873114, 0.040681750230491164, 0.04033397708088159, 0.0395702927261591, 0.039428847230970857, 0.039901224218308926, 0.03863569787144661, 0.039411678291857245, 0.03849020031839609, 0.037254379533231255, 0.03692102897539735]}loss_history: {'val_loss': [0.056037404775619505, 0.05478831511735916, 0.053492555499076846, 0.05259226590394974, 0.05225255781412125], 'loss': [0.06004988470673561, 0.05242427083104849, 0.05080324333161115, 0.04958691381663084, 0.048714143566787244]}