Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 309, 84, 1)   0                                            
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 155, 42, 64)  640         encoded_input[0][0]              
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 78, 21, 64)   36928       conv2d_9[0][0]                   
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 39, 11, 64)   36928       conv2d_10[0][0]                  
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 20, 6, 64)    36928       conv2d_11[0][0]                  
__________________________________________________________________________________________________
reshape_5 (Reshape)             (None, 7680)         0           conv2d_12[0][0]                  
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 1024)         7865344     reshape_5[0][0]                  
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 256)          262400      dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 256)          262400      dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 256)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 8,501,568
Trainable params: 8,501,568
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 256)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 7680)              1973760   
_________________________________________________________________
reshape_6 (Reshape)          (None, 20, 6, 64)         0         
_________________________________________________________________
conv2d_transpose_11 (Conv2DT (None, 40, 12, 64)        36928     
_________________________________________________________________
conv2d_transpose_12 (Conv2DT (None, 80, 24, 64)        36928     
_________________________________________________________________
conv2d_transpose_13 (Conv2DT (None, 160, 48, 64)       36928     
_________________________________________________________________
conv2d_transpose_14 (Conv2DT (None, 320, 96, 64)       36928     
_________________________________________________________________
conv2d_transpose_15 (Conv2DT (None, 320, 96, 1)        577       
_________________________________________________________________
cropping2d_3 (Cropping2D)    (None, 309, 84, 1)        0         
_________________________________________________________________
decoder_output (Activation)  (None, 309, 84, 1)        0         
=================================================================
Total params: 2,122,049
Trainable params: 2,122,049
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
encoder (Model)              [(None, 256), (None, 256) 8501568   
_________________________________________________________________
decoder (Model)              (None, 309, 84, 1)        2122049   
=================================================================
Total params: 10,623,617
Trainable params: 10,623,617
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
encoder (Model)              [(None, 256), (None, 256) 8501568   
_________________________________________________________________
decoder (Model)              (None, 309, 84, 1)        2122049   
=================================================================
Total params: 10,623,617
Trainable params: 10,623,617
Non-trainable params: 0
_________________________________________________________________
val_loss: [0.01351122 0.01180408 0.00916169 0.00852816 0.00893453 0.0075068
 0.00722924 0.00718005 0.00668761 0.00678119 0.00615645 0.00606932
 0.00637144 0.00604439 0.00615019 0.00625774 0.00586176 0.00568653
 0.00624486 0.00546073 0.0057094  0.00542163 0.00566399 0.00523184
 0.00541864 0.00537168 0.00535596 0.00514739 0.00517966 0.00503317]