Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 3, 160, 168,  0                                            
__________________________________________________________________________________________________
conv3d_29 (Conv3D)              (None, 1, 80, 84, 64 1792        encoded_input[0][0]              
__________________________________________________________________________________________________
conv3d_30 (Conv3D)              (None, 1, 40, 42, 64 36928       conv3d_29[0][0]                  
__________________________________________________________________________________________________
conv3d_31 (Conv3D)              (None, 1, 20, 21, 64 36928       conv3d_30[0][0]                  
__________________________________________________________________________________________________
conv3d_32 (Conv3D)              (None, 1, 10, 11, 64 36928       conv3d_31[0][0]                  
__________________________________________________________________________________________________
reshape_15 (Reshape)            (None, 7040)         0           conv3d_32[0][0]                  
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 512)          3604992     reshape_15[0][0]                 
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 512)          262656      dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 512)          262656      dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 512)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 4,242,880
Trainable params: 4,242,880
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 512)               0         
_________________________________________________________________
dense_8 (Dense)              (None, 7040)              3611520   
_________________________________________________________________
reshape_16 (Reshape)         (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_36 (Conv3DT (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_37 (Conv3DT (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_38 (Conv3DT (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_39 (Conv3DT (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_40 (Conv3DT (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_8 (Cropping3D)    (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 3,834,689
Trainable params: 3,834,689
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              [(None, 512), (None, 512) 4242880   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    3834689   
=================================================================
Total params: 8,077,569
Trainable params: 8,077,569
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.04156183624267578, 0.04133838126063347, 0.041327786296606064, 0.041113349884748455, 0.04105396091938019, 0.04074222064018249, 0.0407956523001194, 0.040646259129047395, 0.04030310338735581, 0.03992323112487793], 'loss': [0.03964949081093073, 0.039238215103745464, 0.03963449104875326, 0.03936419694125652, 0.03855655021592975, 0.03813570982962847, 0.03786025910079479, 0.037979854002594945, 0.03819673545658588, 0.03737839134782553]}loss_history: {'val_loss': [0.06153531324863434, 0.060079166531562804, 0.05909847050905228, 0.05947191143035889, 0.05916371536254883], 'loss': [0.07041490332782269, 0.05627017304301262, 0.0554367061406374, 0.05479485215246677, 0.054380241990089416]}loss_history: {'val_loss': [0.058709945678710934, 0.058101120233535766, 0.058472938656806944, 0.057781216859817505, 0.05800881218910217], 'loss': [0.05426442024111748, 0.053599964559078214, 0.05336084806919098, 0.05305776779353619, 0.05264498464018107]}loss_history: {'val_loss': [0.056654434323310854, 0.05630395245552063, 0.05580771923065186, 0.05594134479761124, 0.0558679935336113], 'loss': [0.05138846205174923, 0.050775969102978706, 0.050486110627651216, 0.05027321183681488, 0.050023966044187546]}