Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 1, 80, 84, 64)     1792      
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 1, 40, 42, 64)     36928     
_________________________________________________________________
conv3d_3 (Conv3D)            (None, 1, 20, 21, 64)     36928     
_________________________________________________________________
conv3d_4 (Conv3D)            (None, 1, 10, 11, 64)     36928     
_________________________________________________________________
reshape_1 (Reshape)          (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 128)               901248    
_________________________________________________________________
latent_space (Dense)         (None, 2)                 258       
=================================================================
Total params: 1,014,082
Trainable params: 1,014,082
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 2)                 0         
_________________________________________________________________
dense_1 (Dense)              (None, 7040)              21120     
_________________________________________________________________
reshape_2 (Reshape)          (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_1 (Conv3DTr (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_2 (Conv3DTr (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_3 (Conv3DTr (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_4 (Conv3DTr (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_5 (Conv3DTr (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_1 (Cropping3D)    (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 244,289
Trainable params: 244,289
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              (None, 2)                 1014082   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    244289    
=================================================================
Total params: 1,258,371
Trainable params: 1,258,371
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.1957744653224945, 0.1913627814054489, 0.19237914741039275, 0.1918018192052841, 0.19183361470699312, 0.1923517655134201, 0.19131826770305632, 0.1903099058866501, 0.1901995828151703, 0.19018044197559356, 0.19020193672180175, 0.1904821527004242, 0.19094101893901824, 0.19108900320529937, 0.1905647029876709, 0.190443252325058, 0.19120740842819214, 0.1919606566429138, 0.19039650094509125, 0.1904779040813446], 'loss': [0.4358154444694519, 0.19310122621059417, 0.19221666014194488, 0.19222647684812547, 0.1916860797405243, 0.19165564435720445, 0.19206890213489533, 0.19195027273893356, 0.19172882229089738, 0.19152515083551408, 0.19134334498643876, 0.19143515527248384, 0.1912722365260124, 0.1911857835650444, 0.19146573454141616, 0.1912810851931572, 0.19138328903913499, 0.19148139506578446, 0.1913459211587906, 0.19135578507184983]}