Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 309, 84, 1)   0                                            
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 155, 42, 64)  640         encoded_input[0][0]              
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 78, 21, 64)   36928       conv2d_17[0][0]                  
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 39, 11, 64)   36928       conv2d_18[0][0]                  
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 20, 6, 64)    36928       conv2d_19[0][0]                  
__________________________________________________________________________________________________
reshape_9 (Reshape)             (None, 7680)         0           conv2d_20[0][0]                  
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 512)          3932672     reshape_9[0][0]                  
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 128)          65664       dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 128)          65664       dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 128)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 4,175,424
Trainable params: 4,175,424
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 128)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 7680)              990720    
_________________________________________________________________
reshape_10 (Reshape)         (None, 20, 6, 64)         0         
_________________________________________________________________
conv2d_transpose_21 (Conv2DT (None, 40, 12, 64)        36928     
_________________________________________________________________
conv2d_transpose_22 (Conv2DT (None, 80, 24, 64)        36928     
_________________________________________________________________
conv2d_transpose_23 (Conv2DT (None, 160, 48, 64)       36928     
_________________________________________________________________
conv2d_transpose_24 (Conv2DT (None, 320, 96, 64)       36928     
_________________________________________________________________
conv2d_transpose_25 (Conv2DT (None, 320, 96, 1)        577       
_________________________________________________________________
cropping2d_5 (Cropping2D)    (None, 309, 84, 1)        0         
_________________________________________________________________
decoder_output (Activation)  (None, 309, 84, 1)        0         
=================================================================
Total params: 1,139,009
Trainable params: 1,139,009
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
encoder (Model)              [(None, 128), (None, 128) 4175424   
_________________________________________________________________
decoder (Model)              (None, 309, 84, 1)        1139009   
=================================================================
Total params: 5,314,433
Trainable params: 5,314,433
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.01618766630275382, 0.01424752434508668, 0.012023893797563181, 0.012197582742406262, 0.01038829014947017, 0.010324890294836627, 0.010708578365544478, 0.00955112501151032, 0.009675003898640474, 0.009033303327030605, 0.008743889062768883, 0.008245094406108062, 0.008003136072721746, 0.007965079080313443, 0.007992306562761465, 0.007992725728286637, 0.007728082442449199, 0.007436375709043609, 0.007912043947726488, 0.007369073122325871], 'loss': [0.06006527819153335, 0.015263521617485417, 0.013436753046181468, 0.012164072005285157, 0.011441442155175738, 0.010817870910589894, 0.01041015948065453, 0.010173305595914523, 0.00947791073574788, 0.009685617330380612, 0.009041850093959107, 0.008934354728294744, 0.008687949118514856, 0.008476950353425411, 0.008447507438767288, 0.008647076057063208, 0.008064408922154043, 0.008269053160523374, 0.007961301551096969, 0.00788782936313914]}