Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 309, 84, 1)   0                                            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 155, 42, 64)  640         encoded_input[0][0]              
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 78, 21, 64)   36928       conv2d_5[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 39, 11, 64)   36928       conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 20, 6, 64)    36928       conv2d_7[0][0]                   
__________________________________________________________________________________________________
reshape_3 (Reshape)             (None, 7680)         0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 1024)         7865344     reshape_3[0][0]                  
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 256)          262400      dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 256)          262400      dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 256)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 8,501,568
Trainable params: 8,501,568
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 256)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 7680)              1973760   
_________________________________________________________________
reshape_4 (Reshape)          (None, 20, 6, 64)         0         
_________________________________________________________________
conv2d_transpose_6 (Conv2DTr (None, 40, 12, 64)        36928     
_________________________________________________________________
conv2d_transpose_7 (Conv2DTr (None, 80, 24, 64)        36928     
_________________________________________________________________
conv2d_transpose_8 (Conv2DTr (None, 160, 48, 64)       36928     
_________________________________________________________________
conv2d_transpose_9 (Conv2DTr (None, 320, 96, 64)       36928     
_________________________________________________________________
conv2d_transpose_10 (Conv2DT (None, 320, 96, 1)        577       
_________________________________________________________________
cropping2d_2 (Cropping2D)    (None, 309, 84, 1)        0         
_________________________________________________________________
decoder_output (Activation)  (None, 309, 84, 1)        0         
=================================================================
Total params: 2,122,049
Trainable params: 2,122,049
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
encoder (Model)              [(None, 256), (None, 256) 8501568   
_________________________________________________________________
decoder (Model)              (None, 309, 84, 1)        2122049   
=================================================================
Total params: 10,623,617
Trainable params: 10,623,617
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
encoder (Model)              [(None, 256), (None, 256) 8501568   
_________________________________________________________________
decoder (Model)              (None, 309, 84, 1)        2122049   
=================================================================
Total params: 10,623,617
Trainable params: 10,623,617
Non-trainable params: 0
_________________________________________________________________
val_loss: [0.0123227  0.01038489 0.00906238 0.00877056 0.00836421 0.00894253
 0.0078573  0.00763994 0.00658476 0.00768975 0.0067099  0.00632216
 0.00616304 0.00600348 0.00596846 0.0059797  0.00577056 0.00585224
 0.00577228 0.00553951 0.00577626 0.00538425 0.0058165  0.005337
 0.00540023 0.0052389  0.00522751 0.00540094 0.00539266 0.00513258]