Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
conv3d_33 (Conv3D)           (None, 1, 80, 84, 64)     1792      
_________________________________________________________________
conv3d_34 (Conv3D)           (None, 1, 40, 42, 64)     36928     
_________________________________________________________________
conv3d_35 (Conv3D)           (None, 1, 20, 21, 64)     36928     
_________________________________________________________________
conv3d_36 (Conv3D)           (None, 1, 10, 11, 64)     36928     
_________________________________________________________________
reshape_17 (Reshape)         (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 1024)              7209984   
_________________________________________________________________
latent_space (Dense)         (None, 512)               524800    
=================================================================
Total params: 7,847,360
Trainable params: 7,847,360
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 512)               0         
_________________________________________________________________
dense_9 (Dense)              (None, 7040)              3611520   
_________________________________________________________________
reshape_18 (Reshape)         (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_41 (Conv3DT (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_42 (Conv3DT (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_43 (Conv3DT (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_44 (Conv3DT (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_45 (Conv3DT (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_9 (Cropping3D)    (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 3,834,689
Trainable params: 3,834,689
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              (None, 512)               7847360   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    3834689   
=================================================================
Total params: 11,682,049
Trainable params: 11,682,049
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.050760554552078244, 0.0484494668841362, 0.04759904825687408, 0.04679015749692917, 0.04603241148591042], 'loss': [0.05305639320611954, 0.04532971016317606, 0.04364208084344864, 0.04246798554807901, 0.04134270951896906]}