Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 3, 160, 168,  0                                            
__________________________________________________________________________________________________
conv3d_37 (Conv3D)              (None, 1, 80, 84, 64 1792        encoded_input[0][0]              
__________________________________________________________________________________________________
conv3d_38 (Conv3D)              (None, 1, 40, 42, 64 36928       conv3d_37[0][0]                  
__________________________________________________________________________________________________
conv3d_39 (Conv3D)              (None, 1, 20, 21, 64 36928       conv3d_38[0][0]                  
__________________________________________________________________________________________________
conv3d_40 (Conv3D)              (None, 1, 10, 11, 64 36928       conv3d_39[0][0]                  
__________________________________________________________________________________________________
reshape_19 (Reshape)            (None, 7040)         0           conv3d_40[0][0]                  
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 512)          3604992     reshape_19[0][0]                 
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 512)          262656      dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 512)          262656      dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 512)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 4,242,880
Trainable params: 4,242,880
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 512)               0         
_________________________________________________________________
dense_10 (Dense)             (None, 7040)              3611520   
_________________________________________________________________
reshape_20 (Reshape)         (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_46 (Conv3DT (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_47 (Conv3DT (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_48 (Conv3DT (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_49 (Conv3DT (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_50 (Conv3DT (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_10 (Cropping3D)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 3,834,689
Trainable params: 3,834,689
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              [(None, 512), (None, 512) 4242880   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    3834689   
=================================================================
Total params: 8,077,569
Trainable params: 8,077,569
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.06513624811172486, 0.06295348733663558, 0.06232938921451569, 0.061394777476787565, 0.061428602814674375], 'loss': [0.07587045070528985, 0.060610493674874304, 0.059084625393152235, 0.05829193037748337, 0.05768753536045551]}loss_history: {'val_loss': [0.06073116636276245, 0.060981239378452304, 0.060204149305820465, 0.06006417155265808, 0.059209738790988925], 'loss': [0.057584002561867235, 0.05689639575779438, 0.056663964480161665, 0.056272855825722216, 0.05566820640861988]}