_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 3, 132, 146, 1)    0         
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 3, 132, 146, 16)   448       
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 3, 132, 146, 16)   0         
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 3, 132, 146, 16)   2320      
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 3, 132, 146, 16)   0         
_________________________________________________________________
average_pooling3d_1 (Average (None, 1, 66, 73, 16)     0         
_________________________________________________________________
conv3d_3 (Conv3D)            (None, 1, 66, 73, 32)     4640      
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 1, 66, 73, 32)     0         
_________________________________________________________________
conv3d_4 (Conv3D)            (None, 1, 66, 73, 32)     9248      
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 1, 66, 73, 32)     0         
_________________________________________________________________
average_pooling3d_2 (Average (None, 1, 33, 37, 32)     0         
_________________________________________________________________
conv3d_5 (Conv3D)            (None, 1, 33, 37, 64)     18496     
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 1, 33, 37, 64)     0         
_________________________________________________________________
conv3d_6 (Conv3D)            (None, 1, 33, 37, 64)     36928     
_________________________________________________________________
leaky_re_lu_6 (LeakyReLU)    (None, 1, 33, 37, 64)     0         
_________________________________________________________________
average_pooling3d_3 (Average (None, 1, 17, 19, 64)     0         
_________________________________________________________________
conv3d_7 (Conv3D)            (None, 1, 17, 19, 64)     36928     
_________________________________________________________________
leaky_re_lu_7 (LeakyReLU)    (None, 1, 17, 19, 64)     0         
_________________________________________________________________
average_pooling3d_4 (Average (None, 1, 9, 10, 64)      0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 5760)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               1474816   
_________________________________________________________________
dense_2 (Dense)              (None, 128)               32896     
=================================================================
Total params: 1,616,720
Trainable params: 1,616,720
Non-trainable params: 0
_________________________________________________________________
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         (None, 128)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 256)               33024     
_________________________________________________________________
dense_4 (Dense)              (None, 5760)              1480320   
_________________________________________________________________
reshape_1 (Reshape)          (None, 1, 9, 10, 64)      0         
_________________________________________________________________
up_sampling3d_1 (UpSampling3 (None, 1, 18, 20, 64)     0         
_________________________________________________________________
conv3d_transpose_1 (Conv3DTr (None, 1, 18, 20, 64)     36928     
_________________________________________________________________
leaky_re_lu_8 (LeakyReLU)    (None, 1, 18, 20, 64)     0         
_________________________________________________________________
conv3d_transpose_2 (Conv3DTr (None, 1, 18, 20, 64)     36928     
_________________________________________________________________
leaky_re_lu_9 (LeakyReLU)    (None, 1, 18, 20, 64)     0         
_________________________________________________________________
up_sampling3d_2 (UpSampling3 (None, 1, 36, 40, 64)     0         
_________________________________________________________________
conv3d_transpose_3 (Conv3DTr (None, 1, 36, 40, 64)     36928     
_________________________________________________________________
leaky_re_lu_10 (LeakyReLU)   (None, 1, 36, 40, 64)     0         
_________________________________________________________________
up_sampling3d_3 (UpSampling3 (None, 1, 72, 80, 64)     0         
_________________________________________________________________
conv3d_transpose_4 (Conv3DTr (None, 1, 74, 82, 64)     36928     
_________________________________________________________________
leaky_re_lu_11 (LeakyReLU)   (None, 1, 74, 82, 64)     0         
_________________________________________________________________
conv3d_transpose_5 (Conv3DTr (None, 1, 74, 82, 64)     36928     
_________________________________________________________________
leaky_re_lu_12 (LeakyReLU)   (None, 1, 74, 82, 64)     0         
_________________________________________________________________
up_sampling3d_4 (UpSampling3 (None, 3, 148, 164, 64)   0         
_________________________________________________________________
conv3d_transpose_6 (Conv3DTr (None, 3, 148, 164, 32)   18464     
_________________________________________________________________
leaky_re_lu_13 (LeakyReLU)   (None, 3, 148, 164, 32)   0         
_________________________________________________________________
conv3d_transpose_7 (Conv3DTr (None, 3, 148, 164, 32)   9248      
_________________________________________________________________
leaky_re_lu_14 (LeakyReLU)   (None, 3, 148, 164, 32)   0         
_________________________________________________________________
conv3d_transpose_8 (Conv3DTr (None, 3, 148, 164, 1)    865       
_________________________________________________________________
cropping3d_1 (Cropping3D)    (None, 3, 132, 146, 1)    0         
=================================================================
Total params: 1,726,561
Trainable params: 1,726,561
Non-trainable params: 0
_________________________________________________________________
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 3, 132, 146, 1)    0         
_________________________________________________________________
model_1 (Model)              (None, 128)               1616720   
_________________________________________________________________
model_2 (Model)              (None, 3, 132, 146, 1)    1726561   
=================================================================
Total params: 3,343,281
Trainable params: 3,343,281
Non-trainable params: 0
_________________________________________________________________
