Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 3, 160, 168,  0                                            
__________________________________________________________________________________________________
conv3d_17 (Conv3D)              (None, 1, 80, 84, 64 1792        encoded_input[0][0]              
__________________________________________________________________________________________________
conv3d_18 (Conv3D)              (None, 1, 40, 42, 64 36928       conv3d_17[0][0]                  
__________________________________________________________________________________________________
conv3d_19 (Conv3D)              (None, 1, 20, 21, 64 36928       conv3d_18[0][0]                  
__________________________________________________________________________________________________
conv3d_20 (Conv3D)              (None, 1, 10, 11, 64 36928       conv3d_19[0][0]                  
__________________________________________________________________________________________________
reshape_9 (Reshape)             (None, 7040)         0           conv3d_20[0][0]                  
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 1024)         7209984     reshape_9[0][0]                  
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 512)          524800      dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 512)          524800      dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 512)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 8,372,160
Trainable params: 8,372,160
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 512)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 7040)              3611520   
_________________________________________________________________
reshape_10 (Reshape)         (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_21 (Conv3DT (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_22 (Conv3DT (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_23 (Conv3DT (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_24 (Conv3DT (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_25 (Conv3DT (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_5 (Cropping3D)    (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 3,834,689
Trainable params: 3,834,689
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              [(None, 512), (None, 512) 8372160   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    3834689   
=================================================================
Total params: 12,206,849
Trainable params: 12,206,849
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.044137773394584655, 0.04484871140122414, 0.04375014626979828, 0.04476108679175377, 0.04456763380765915, 0.04335292986035347, 0.042900173604488376, 0.04273352858424187, 0.0431488029062748, 0.04278894492983818], 'loss': [0.04346032766997814, 0.0434381730556488, 0.042694321535527706, 0.042469545677304266, 0.04337681943178177, 0.04217734964191914, 0.04166159508377314, 0.04131013768911362, 0.041132668182253834, 0.041393157951533796]}loss_history: {'val_loss': [0.06559313333034515, 0.0634298111796379, 0.06335732942819595, 0.06259217584133148, 0.062073424398899076], 'loss': [0.07732948473095894, 0.0607901650518179, 0.05982593564689159, 0.05941972517967224, 0.05899068982899189]}