Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 160, 168, 1)       0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 80, 84, 64)        640       
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 40, 42, 64)        36928     
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 20, 21, 64)        36928     
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 10, 11, 64)        36928     
_________________________________________________________________
reshape_7 (Reshape)          (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 512)               3604992   
_________________________________________________________________
latent_space (Dense)         (None, 128)               65664     
=================================================================
Total params: 3,782,080
Trainable params: 3,782,080
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 128)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 7040)              908160    
_________________________________________________________________
reshape_8 (Reshape)          (None, 10, 11, 64)        0         
_________________________________________________________________
conv2d_transpose_16 (Conv2DT (None, 20, 22, 64)        36928     
_________________________________________________________________
conv2d_transpose_17 (Conv2DT (None, 40, 44, 64)        36928     
_________________________________________________________________
conv2d_transpose_18 (Conv2DT (None, 80, 88, 64)        36928     
_________________________________________________________________
conv2d_transpose_19 (Conv2DT (None, 160, 176, 64)      36928     
_________________________________________________________________
conv2d_transpose_20 (Conv2DT (None, 160, 176, 1)       577       
_________________________________________________________________
cropping2d_4 (Cropping2D)    (None, 160, 168, 1)       0         
_________________________________________________________________
decoder_output (Activation)  (None, 160, 168, 1)       0         
=================================================================
Total params: 1,056,449
Trainable params: 1,056,449
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 160, 168, 1)       0         
_________________________________________________________________
encoder (Model)              (None, 128)               3782080   
_________________________________________________________________
decoder (Model)              (None, 160, 168, 1)       1056449   
=================================================================
Total params: 4,838,529
Trainable params: 4,838,529
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 160, 168, 1)       0         
_________________________________________________________________
encoder (Model)              (None, 128)               3782080   
_________________________________________________________________
decoder (Model)              (None, 160, 168, 1)       1056449   
=================================================================
Total params: 4,838,529
Trainable params: 4,838,529
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.04209071071197589, 0.04019479118287563, 0.03803373416264852, 0.03705646296342214, 0.036092781312763694, 0.03537599820643664, 0.03424620140343904, 0.03474155871818463, 0.03369822387893995, 0.03321050688624382], 'loss': [0.04822932505048812, 0.0410430148585389, 0.03851477347935239, 0.03662359881835679, 0.03534510290250182, 0.03425128107890487, 0.03337258660234511, 0.03265575394344827, 0.03196939630589137, 0.031267198914041124]}