Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 3, 160, 168,  0                                            
__________________________________________________________________________________________________
conv3d_21 (Conv3D)              (None, 1, 80, 84, 64 1792        encoded_input[0][0]              
__________________________________________________________________________________________________
conv3d_22 (Conv3D)              (None, 1, 40, 42, 64 36928       conv3d_21[0][0]                  
__________________________________________________________________________________________________
conv3d_23 (Conv3D)              (None, 1, 20, 21, 64 36928       conv3d_22[0][0]                  
__________________________________________________________________________________________________
conv3d_24 (Conv3D)              (None, 1, 10, 11, 64 36928       conv3d_23[0][0]                  
__________________________________________________________________________________________________
reshape_11 (Reshape)            (None, 7040)         0           conv3d_24[0][0]                  
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 512)          3604992     reshape_11[0][0]                 
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 512)          262656      dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 512)          262656      dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 512)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 4,242,880
Trainable params: 4,242,880
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 512)               0         
_________________________________________________________________
dense_6 (Dense)              (None, 7040)              3611520   
_________________________________________________________________
reshape_12 (Reshape)         (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_26 (Conv3DT (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_27 (Conv3DT (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_28 (Conv3DT (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_29 (Conv3DT (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_30 (Conv3DT (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_6 (Cropping3D)    (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 3,834,689
Trainable params: 3,834,689
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              [(None, 512), (None, 512) 4242880   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    3834689   
=================================================================
Total params: 8,077,569
Trainable params: 8,077,569
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.2182479386329651, 0.17682959985733032, 0.16175353193283082, 0.16044705820083618, 0.15156151854991912, 0.15325414061546325, 0.1485840300321579, 0.1515729466676712, 0.14517549002170563, 0.14561080241203309], 'loss': [0.4663505308032036, 0.19714423173666, 0.17357075732946395, 0.1644099191725254, 0.1601160987019539, 0.15657536900043487, 0.15552791318297385, 0.15287034976482392, 0.15090649843215942, 0.14967704811692237]}