Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 155, 42, 64)       640       
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 78, 21, 64)        36928     
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 39, 11, 64)        36928     
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 20, 6, 64)         36928     
_________________________________________________________________
reshape_3 (Reshape)          (None, 7680)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 512)               3932672   
_________________________________________________________________
latent_space (Dense)         (None, 128)               65664     
=================================================================
Total params: 4,109,760
Trainable params: 4,109,760
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 7680)              990720    
_________________________________________________________________
reshape_4 (Reshape)          (None, 20, 6, 64)         0         
_________________________________________________________________
conv2d_transpose_6 (Conv2DTr (None, 40, 12, 64)        36928     
_________________________________________________________________
conv2d_transpose_7 (Conv2DTr (None, 80, 24, 64)        36928     
_________________________________________________________________
conv2d_transpose_8 (Conv2DTr (None, 160, 48, 64)       36928     
_________________________________________________________________
conv2d_transpose_9 (Conv2DTr (None, 320, 96, 64)       36928     
_________________________________________________________________
conv2d_transpose_10 (Conv2DT (None, 320, 96, 1)        577       
_________________________________________________________________
cropping2d_2 (Cropping2D)    (None, 309, 84, 1)        0         
_________________________________________________________________
decoder_output (Activation)  (None, 309, 84, 1)        0         
=================================================================
Total params: 1,139,009
Trainable params: 1,139,009
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
encoder (Model)              (None, 128)               4109760   
_________________________________________________________________
decoder (Model)              (None, 309, 84, 1)        1139009   
=================================================================
Total params: 5,248,769
Trainable params: 5,248,769
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.006210964486623804, 0.0037469776704286534, 0.002566378448779384, 0.002173272044553111, 0.001932200069228808, 0.0017168517915221553, 0.0015665353136137129, 0.0026751968807851275, 0.001479385949205607, 0.0014178212933863203], 'loss': [0.047749641057259096, 0.004177091921834896, 0.0030344461956216644, 0.0023752833262551576, 0.0025896561784126484, 0.0016730944717225308, 0.001530725179084887, 0.0016779627804256354, 0.001433084793194818, 0.0012953870458295568]}