Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
conv3d_9 (Conv3D)            (None, 1, 80, 84, 64)     1792      
_________________________________________________________________
conv3d_10 (Conv3D)           (None, 1, 40, 42, 64)     36928     
_________________________________________________________________
conv3d_11 (Conv3D)           (None, 1, 20, 21, 64)     36928     
_________________________________________________________________
conv3d_12 (Conv3D)           (None, 1, 10, 11, 64)     36928     
_________________________________________________________________
reshape_5 (Reshape)          (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 128)               901248    
_________________________________________________________________
latent_space (Dense)         (None, 2)                 258       
=================================================================
Total params: 1,014,082
Trainable params: 1,014,082
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 2)                 0         
_________________________________________________________________
dense_3 (Dense)              (None, 7040)              21120     
_________________________________________________________________
reshape_6 (Reshape)          (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_11 (Conv3DT (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_12 (Conv3DT (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_13 (Conv3DT (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_14 (Conv3DT (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_15 (Conv3DT (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_3 (Cropping3D)    (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 244,289
Trainable params: 244,289
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              (None, 2)                 1014082   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    244289    
=================================================================
Total params: 1,258,371
Trainable params: 1,258,371
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.19611059248447418, 0.19338456964492798, 0.1916085983514786, 0.19109778451919557, 0.19056889414787292, 0.19103564012050628, 0.19063344514369965, 0.19043781220912934, 0.1905044399499893, 0.19034562051296233, 0.1910775274038315, 0.19101471781730653, 0.19076407766342163, 0.1900519242286682, 0.19025785541534423, 0.191625772356987, 0.1918859977722168, 0.19162057805061342, 0.1900380802154541, 0.19061523866653443], 'loss': [0.5374088753461838, 0.1943900738954544, 0.19289381521940233, 0.1923582403063774, 0.19184183263778687, 0.1920201872587204, 0.191588436961174, 0.19167442137002946, 0.19144969511032103, 0.19166052514314652, 0.19145510995388032, 0.191496064722538, 0.19186181336641311, 0.19127721613645554, 0.19132942008972167, 0.19152530825138092, 0.1912904732823372, 0.19177026677131653, 0.1912390614748001, 0.1911986431479454]}