Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 155, 42, 64)       640       
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 78, 21, 64)        36928     
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 39, 11, 64)        36928     
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 20, 6, 64)         36928     
_________________________________________________________________
reshape_7 (Reshape)          (None, 7680)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 256)               1966336   
_________________________________________________________________
latent_space (Dense)         (None, 64)                16448     
=================================================================
Total params: 2,094,208
Trainable params: 2,094,208
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 64)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 7680)              499200    
_________________________________________________________________
reshape_8 (Reshape)          (None, 20, 6, 64)         0         
_________________________________________________________________
conv2d_transpose_16 (Conv2DT (None, 40, 12, 64)        36928     
_________________________________________________________________
conv2d_transpose_17 (Conv2DT (None, 80, 24, 64)        36928     
_________________________________________________________________
conv2d_transpose_18 (Conv2DT (None, 160, 48, 64)       36928     
_________________________________________________________________
conv2d_transpose_19 (Conv2DT (None, 320, 96, 64)       36928     
_________________________________________________________________
conv2d_transpose_20 (Conv2DT (None, 320, 96, 1)        577       
_________________________________________________________________
cropping2d_4 (Cropping2D)    (None, 309, 84, 1)        0         
_________________________________________________________________
decoder_output (Activation)  (None, 309, 84, 1)        0         
=================================================================
Total params: 647,489
Trainable params: 647,489
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
encoder (Model)              (None, 64)                2094208   
_________________________________________________________________
decoder (Model)              (None, 309, 84, 1)        647489    
=================================================================
Total params: 2,741,697
Trainable params: 2,741,697
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.011366170812398196, 0.0061338100023567675, 0.004693831152593096, 0.004118847390636802, 0.0035516025576119623, 0.0034155221624920765, 0.003176714675500989, 0.003178433078962068, 0.0026504392207910617, 0.002504168702289462], 'loss': [0.09444754048250616, 0.007822477748462309, 0.00509607350298514, 0.004242258558515459, 0.0035878718066184472, 0.0031996403444403162, 0.002979211888741702, 0.002772249743187179, 0.0026985830538130053, 0.002557612279585252]}