Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 309, 84, 1)     0         
_________________________________________________________________
conv3d_53 (Conv3D)           (None, 1, 155, 42, 64)    1792      
_________________________________________________________________
conv3d_54 (Conv3D)           (None, 1, 78, 21, 64)     36928     
_________________________________________________________________
conv3d_55 (Conv3D)           (None, 1, 39, 11, 64)     36928     
_________________________________________________________________
conv3d_56 (Conv3D)           (None, 1, 20, 6, 64)      36928     
_________________________________________________________________
reshape_27 (Reshape)         (None, 7680)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 512)               3932672   
_________________________________________________________________
latent_space (Dense)         (None, 256)               131328    
=================================================================
Total params: 4,176,576
Trainable params: 4,176,576
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 256)               0         
_________________________________________________________________
dense_14 (Dense)             (None, 7680)              1973760   
_________________________________________________________________
reshape_28 (Reshape)         (None, 1, 20, 6, 64)      0         
_________________________________________________________________
conv3d_transpose_66 (Conv3DT (None, 1, 40, 12, 64)     36928     
_________________________________________________________________
conv3d_transpose_67 (Conv3DT (None, 1, 80, 24, 64)     36928     
_________________________________________________________________
conv3d_transpose_68 (Conv3DT (None, 1, 160, 48, 64)    36928     
_________________________________________________________________
conv3d_transpose_69 (Conv3DT (None, 3, 320, 96, 64)    110656    
_________________________________________________________________
conv3d_transpose_70 (Conv3DT (None, 3, 320, 96, 1)     1729      
_________________________________________________________________
cropping3d_14 (Cropping3D)   (None, 3, 309, 84, 1)     0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 309, 84, 1)     0         
=================================================================
Total params: 2,196,929
Trainable params: 2,196,929
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 309, 84, 1)     0         
_________________________________________________________________
encoder (Model)              (None, 256)               4176576   
_________________________________________________________________
decoder (Model)              (None, 3, 309, 84, 1)     2196929   
=================================================================
Total params: 6,373,505
Trainable params: 6,373,505
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.004551015241692463, 0.004395019734899203, 0.00440033291776975, 0.00441808649028341, 0.004848616359134515], 'loss': [0.007229754241804282, 0.004477270287461579, 0.004314369559288025, 0.004290123598960539, 0.004307509039839109]}loss_history: {'val_loss': [0.0040967919677495955, 0.0038581669641037783, 0.0037401378465195495, 0.0036556100162367026, 0.0035787416559954484], 'loss': [0.010842078174464405, 0.003960343465829889, 0.0037976059907426436, 0.003691827125536899, 0.003609224194660783]}