Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
conv3d_53 (Conv3D)           (None, 1, 80, 84, 64)     1792      
_________________________________________________________________
conv3d_54 (Conv3D)           (None, 1, 40, 42, 64)     36928     
_________________________________________________________________
conv3d_55 (Conv3D)           (None, 1, 20, 21, 64)     36928     
_________________________________________________________________
conv3d_56 (Conv3D)           (None, 1, 10, 11, 64)     36928     
_________________________________________________________________
reshape_27 (Reshape)         (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 512)               3604992   
_________________________________________________________________
latent_space (Dense)         (None, 256)               131328    
=================================================================
Total params: 3,848,896
Trainable params: 3,848,896
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 256)               0         
_________________________________________________________________
dense_14 (Dense)             (None, 7040)              1809280   
_________________________________________________________________
reshape_28 (Reshape)         (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_66 (Conv3DT (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_67 (Conv3DT (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_68 (Conv3DT (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_69 (Conv3DT (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_70 (Conv3DT (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_14 (Cropping3D)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 2,032,449
Trainable params: 2,032,449
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              (None, 256)               3848896   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    2032449   
=================================================================
Total params: 5,881,345
Trainable params: 5,881,345
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.05662242186069488, 0.05503121697902679, 0.05434357124567032, 0.0531564137339592, 0.05249006623029709], 'loss': [0.06130712801218033, 0.052479337826371195, 0.0506457149386406, 0.04983562203496695, 0.048654492519795894]}