Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 3, 160, 168,  0                                            
__________________________________________________________________________________________________
conv3d_13 (Conv3D)              (None, 1, 80, 84, 64 1792        encoded_input[0][0]              
__________________________________________________________________________________________________
conv3d_14 (Conv3D)              (None, 1, 40, 42, 64 36928       conv3d_13[0][0]                  
__________________________________________________________________________________________________
conv3d_15 (Conv3D)              (None, 1, 20, 21, 64 36928       conv3d_14[0][0]                  
__________________________________________________________________________________________________
conv3d_16 (Conv3D)              (None, 1, 10, 11, 64 36928       conv3d_15[0][0]                  
__________________________________________________________________________________________________
reshape_7 (Reshape)             (None, 7040)         0           conv3d_16[0][0]                  
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 1024)         7209984     reshape_7[0][0]                  
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 512)          524800      dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 512)          524800      dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 512)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 8,372,160
Trainable params: 8,372,160
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 512)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 7040)              3611520   
_________________________________________________________________
reshape_8 (Reshape)          (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_16 (Conv3DT (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_17 (Conv3DT (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_18 (Conv3DT (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_19 (Conv3DT (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_20 (Conv3DT (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_4 (Cropping3D)    (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 3,834,689
Trainable params: 3,834,689
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              [(None, 512), (None, 512) 8372160   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    3834689   
=================================================================
Total params: 12,206,849
Trainable params: 12,206,849
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.0444198148548603, 0.04467478710412979, 0.04380059295892715, 0.04375571373105049, 0.043572770535945896, 0.044389233589172364, 0.043599077969789506, 0.0436852163374424, 0.04330103665590286, 0.043636539697647095], 'loss': [0.04465493758022785, 0.044742289803922176, 0.04278265801072121, 0.04267716111987829, 0.04241369054466486, 0.04684796442836523, 0.04236581851541996, 0.04176171753555536, 0.04142565558105707, 0.04178150023519993]}loss_history: {'val_loss': [0.06938454592227936, 0.06536355298757553, 0.06447365725040435, 0.06428087639808655, 0.06354644232988357], 'loss': [0.08756568711996078, 0.06461093266308307, 0.06211673386394977, 0.061111317574977876, 0.060580636367201804]}