Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 3, 309, 84, 1 0                                            
__________________________________________________________________________________________________
conv3d_105 (Conv3D)             (None, 1, 155, 42, 6 1792        encoded_input[0][0]              
__________________________________________________________________________________________________
conv3d_106 (Conv3D)             (None, 1, 78, 21, 64 36928       conv3d_105[0][0]                 
__________________________________________________________________________________________________
conv3d_107 (Conv3D)             (None, 1, 39, 11, 64 36928       conv3d_106[0][0]                 
__________________________________________________________________________________________________
conv3d_108 (Conv3D)             (None, 1, 20, 6, 64) 36928       conv3d_107[0][0]                 
__________________________________________________________________________________________________
reshape_53 (Reshape)            (None, 7680)         0           conv3d_108[0][0]                 
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 1024)         7865344     reshape_53[0][0]                 
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 512)          524800      dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 512)          524800      dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 512)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 9,027,520
Trainable params: 9,027,520
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 512)               0         
_________________________________________________________________
dense_27 (Dense)             (None, 7680)              3939840   
_________________________________________________________________
reshape_54 (Reshape)         (None, 1, 20, 6, 64)      0         
_________________________________________________________________
conv3d_transpose_131 (Conv3D (None, 1, 40, 12, 64)     36928     
_________________________________________________________________
conv3d_transpose_132 (Conv3D (None, 1, 80, 24, 64)     36928     
_________________________________________________________________
conv3d_transpose_133 (Conv3D (None, 1, 160, 48, 64)    36928     
_________________________________________________________________
conv3d_transpose_134 (Conv3D (None, 3, 320, 96, 64)    110656    
_________________________________________________________________
conv3d_transpose_135 (Conv3D (None, 3, 320, 96, 1)     1729      
_________________________________________________________________
cropping3d_27 (Cropping3D)   (None, 3, 309, 84, 1)     0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 309, 84, 1)     0         
=================================================================
Total params: 4,163,009
Trainable params: 4,163,009
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 309, 84, 1)     0         
_________________________________________________________________
encoder (Model)              [(None, 512), (None, 512) 9027520   
_________________________________________________________________
decoder (Model)              (None, 3, 309, 84, 1)     4163009   
=================================================================
Total params: 13,190,529
Trainable params: 13,190,529
Non-trainable params: 0
_________________________________________________________________
