Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 155, 42, 64)       640       
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 78, 21, 64)        36928     
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 39, 11, 64)        36928     
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 20, 6, 64)         36928     
_________________________________________________________________
reshape_3 (Reshape)          (None, 7680)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 256)               1966336   
_________________________________________________________________
latent_space (Dense)         (None, 64)                16448     
=================================================================
Total params: 2,094,208
Trainable params: 2,094,208
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 64)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 7680)              499200    
_________________________________________________________________
reshape_4 (Reshape)          (None, 20, 6, 64)         0         
_________________________________________________________________
conv2d_transpose_6 (Conv2DTr (None, 40, 12, 64)        36928     
_________________________________________________________________
conv2d_transpose_7 (Conv2DTr (None, 80, 24, 64)        36928     
_________________________________________________________________
conv2d_transpose_8 (Conv2DTr (None, 160, 48, 64)       36928     
_________________________________________________________________
conv2d_transpose_9 (Conv2DTr (None, 320, 96, 64)       36928     
_________________________________________________________________
conv2d_transpose_10 (Conv2DT (None, 320, 96, 1)        577       
_________________________________________________________________
cropping2d_2 (Cropping2D)    (None, 309, 84, 1)        0         
_________________________________________________________________
decoder_output (Activation)  (None, 309, 84, 1)        0         
=================================================================
Total params: 647,489
Trainable params: 647,489
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
encoder (Model)              (None, 64)                2094208   
_________________________________________________________________
decoder (Model)              (None, 309, 84, 1)        647489    
=================================================================
Total params: 2,741,697
Trainable params: 2,741,697
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.01153595837454001, 0.006095591516544422, 0.0051269514424105486, 0.00396893079392612, 0.0036788317933678628, 0.003271867063206931, 0.0029100446480636796, 0.002846681927330792, 0.0028634506557136774, 0.0027331688487902284], 'loss': [0.07391010661764691, 0.0077543629581729575, 0.005165331920919319, 0.004271262007920692, 0.003528857195439438, 0.003173708397662267, 0.002945699108531699, 0.0027253488237814357, 0.0026251864933874458, 0.002425332380613933]}