Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 3, 309, 84, 1 0                                            
__________________________________________________________________________________________________
conv3d_57 (Conv3D)              (None, 1, 155, 42, 6 1792        encoded_input[0][0]              
__________________________________________________________________________________________________
conv3d_58 (Conv3D)              (None, 1, 78, 21, 64 36928       conv3d_57[0][0]                  
__________________________________________________________________________________________________
conv3d_59 (Conv3D)              (None, 1, 39, 11, 64 36928       conv3d_58[0][0]                  
__________________________________________________________________________________________________
conv3d_60 (Conv3D)              (None, 1, 20, 6, 64) 36928       conv3d_59[0][0]                  
__________________________________________________________________________________________________
reshape_29 (Reshape)            (None, 7680)         0           conv3d_60[0][0]                  
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 512)          3932672     reshape_29[0][0]                 
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 256)          131328      dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 256)          131328      dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 256)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 4,307,904
Trainable params: 4,307,904
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 256)               0         
_________________________________________________________________
dense_15 (Dense)             (None, 7680)              1973760   
_________________________________________________________________
reshape_30 (Reshape)         (None, 1, 20, 6, 64)      0         
_________________________________________________________________
conv3d_transpose_71 (Conv3DT (None, 1, 40, 12, 64)     36928     
_________________________________________________________________
conv3d_transpose_72 (Conv3DT (None, 1, 80, 24, 64)     36928     
_________________________________________________________________
conv3d_transpose_73 (Conv3DT (None, 1, 160, 48, 64)    36928     
_________________________________________________________________
conv3d_transpose_74 (Conv3DT (None, 3, 320, 96, 64)    110656    
_________________________________________________________________
conv3d_transpose_75 (Conv3DT (None, 3, 320, 96, 1)     1729      
_________________________________________________________________
cropping3d_15 (Cropping3D)   (None, 3, 309, 84, 1)     0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 309, 84, 1)     0         
=================================================================
Total params: 2,196,929
Trainable params: 2,196,929
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 309, 84, 1)     0         
_________________________________________________________________
encoder (Model)              [(None, 256), (None, 256) 4307904   
_________________________________________________________________
decoder (Model)              (None, 3, 309, 84, 1)     2196929   
=================================================================
Total params: 6,504,833
Trainable params: 6,504,833
Non-trainable params: 0
_________________________________________________________________
