Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 3, 160, 168,  0                                            
__________________________________________________________________________________________________
conv3d_13 (Conv3D)              (None, 1, 80, 84, 64 1792        encoded_input[0][0]              
__________________________________________________________________________________________________
conv3d_14 (Conv3D)              (None, 1, 40, 42, 64 36928       conv3d_13[0][0]                  
__________________________________________________________________________________________________
conv3d_15 (Conv3D)              (None, 1, 20, 21, 64 36928       conv3d_14[0][0]                  
__________________________________________________________________________________________________
conv3d_16 (Conv3D)              (None, 1, 10, 11, 64 36928       conv3d_15[0][0]                  
__________________________________________________________________________________________________
reshape_7 (Reshape)             (None, 7040)         0           conv3d_16[0][0]                  
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 512)          3604992     reshape_7[0][0]                  
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 512)          262656      dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 512)          262656      dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 512)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 4,242,880
Trainable params: 4,242,880
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 512)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 7040)              3611520   
_________________________________________________________________
reshape_8 (Reshape)          (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_16 (Conv3DT (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_17 (Conv3DT (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_18 (Conv3DT (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_19 (Conv3DT (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_20 (Conv3DT (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_4 (Cropping3D)    (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 3,834,689
Trainable params: 3,834,689
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              [(None, 512), (None, 512) 4242880   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    3834689   
=================================================================
Total params: 8,077,569
Trainable params: 8,077,569
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.13969362437725066, 0.12068442213535309, 0.11133168172836304, 0.10741644954681397, 0.10379638904333115, 0.10186449575424195, 0.09925762605667114, 0.09841294872760772, 0.09689071244001389, 0.09545919942855835], 'loss': [0.32994196072220805, 0.13005662235617638, 0.11710062032938004, 0.1108389700949192, 0.10694664803147316, 0.10398291978240014, 0.10199755683541298, 0.09971514913439751, 0.0985171237885952, 0.09714921334385872]}