Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 309, 84, 1)   0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 155, 42, 64)  640         encoded_input[0][0]              
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 78, 21, 64)   36928       conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 39, 11, 64)   36928       conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 20, 6, 64)    36928       conv2d_3[0][0]                   
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 7680)         0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 512)          3932672     reshape_1[0][0]                  
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 128)          65664       dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 128)          65664       dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 128)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 4,175,424
Trainable params: 4,175,424
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 7680)              990720    
_________________________________________________________________
reshape_2 (Reshape)          (None, 20, 6, 64)         0         
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 40, 12, 64)        36928     
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 80, 24, 64)        36928     
_________________________________________________________________
conv2d_transpose_3 (Conv2DTr (None, 160, 48, 64)       36928     
_________________________________________________________________
conv2d_transpose_4 (Conv2DTr (None, 320, 96, 64)       36928     
_________________________________________________________________
conv2d_transpose_5 (Conv2DTr (None, 320, 96, 1)        577       
_________________________________________________________________
cropping2d_1 (Cropping2D)    (None, 309, 84, 1)        0         
_________________________________________________________________
decoder_output (Activation)  (None, 309, 84, 1)        0         
=================================================================
Total params: 1,139,009
Trainable params: 1,139,009
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
encoder (Model)              [(None, 128), (None, 128) 4175424   
_________________________________________________________________
decoder (Model)              (None, 309, 84, 1)        1139009   
=================================================================
Total params: 5,314,433
Trainable params: 5,314,433
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.016776303698619207, 0.014619437170525391, 0.011938727870583534, 0.011236642147931788, 0.011751685759259594, 0.010161005953947703, 0.010079993104769125, 0.009660694036218855, 0.009034211420350605, 0.00873621323870288, 0.00843409638851881, 0.008635661742753454, 0.007887708668907483, 0.008866154866086112, 0.007869276288482878, 0.008007332786089845, 0.00765197980735037, 0.007378067036883699, 0.009707538075745106, 0.007762986967960994], 'loss': [0.0601856135783924, 0.01502842307711641, 0.013433596663590935, 0.012318447904868258, 0.011493954728874895, 0.011225308888695306, 0.010433616272898185, 0.009883559769433406, 0.009583397846048078, 0.009321546291725503, 0.009143023912070527, 0.009015143556106421, 0.008836229833670788, 0.008415386236997115, 0.008271565214834279, 0.008324445307047831, 0.008062008519967396, 0.007890519953022401, 0.007951520757956637, 0.00787399344974094]}