Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
conv3d_13 (Conv3D)           (None, 1, 80, 84, 64)     1792      
_________________________________________________________________
conv3d_14 (Conv3D)           (None, 1, 40, 42, 64)     36928     
_________________________________________________________________
conv3d_15 (Conv3D)           (None, 1, 20, 21, 64)     36928     
_________________________________________________________________
conv3d_16 (Conv3D)           (None, 1, 10, 11, 64)     36928     
_________________________________________________________________
reshape_7 (Reshape)          (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 128)               901248    
_________________________________________________________________
latent_space (Dense)         (None, 2)                 258       
=================================================================
Total params: 1,014,082
Trainable params: 1,014,082
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 2)                 0         
_________________________________________________________________
dense_4 (Dense)              (None, 7040)              21120     
_________________________________________________________________
reshape_8 (Reshape)          (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_16 (Conv3DT (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_17 (Conv3DT (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_18 (Conv3DT (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_19 (Conv3DT (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_20 (Conv3DT (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_4 (Cropping3D)    (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 244,289
Trainable params: 244,289
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              (None, 2)                 1014082   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    244289    
=================================================================
Total params: 1,258,371
Trainable params: 1,258,371
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.19389389538764953, 0.19174943566322328, 0.19466193568706514, 0.19054318952560426, 0.19038229286670685, 0.19051804614067078, 0.19095991981029511, 0.191889617562294, 0.19054449367523194, 0.1902570297718048, 0.19119317376613618, 0.19038079237937927, 0.19065112674236298, 0.1904434142112732, 0.19097888505458832, 0.19012420547008516, 0.19027909517288208, 0.19006275260448455, 0.19089273071289062, 0.19168734467029572], 'loss': [0.5217577351927757, 0.19498381400108336, 0.19259896141290664, 0.1924526223540306, 0.19207003808021544, 0.19276033145189286, 0.19201497101783752, 0.1920721474289894, 0.1919515627026558, 0.19159907352924346, 0.1914430570602417, 0.1914868724346161, 0.19175068598985673, 0.19174397665262222, 0.19171059465408324, 0.1913748156428337, 0.1914460250735283, 0.1914977497458458, 0.1913708388209343, 0.19135214257240296]}