Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 309, 84, 1)   0                                            
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 155, 42, 64)  640         encoded_input[0][0]              
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 78, 21, 64)   36928       conv2d_21[0][0]                  
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 39, 11, 64)   36928       conv2d_22[0][0]                  
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 20, 6, 64)    36928       conv2d_23[0][0]                  
__________________________________________________________________________________________________
reshape_11 (Reshape)            (None, 7680)         0           conv2d_24[0][0]                  
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 512)          3932672     reshape_11[0][0]                 
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 128)          65664       dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 128)          65664       dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 128)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 4,175,424
Trainable params: 4,175,424
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 128)               0         
_________________________________________________________________
dense_6 (Dense)              (None, 7680)              990720    
_________________________________________________________________
reshape_12 (Reshape)         (None, 20, 6, 64)         0         
_________________________________________________________________
conv2d_transpose_26 (Conv2DT (None, 40, 12, 64)        36928     
_________________________________________________________________
conv2d_transpose_27 (Conv2DT (None, 80, 24, 64)        36928     
_________________________________________________________________
conv2d_transpose_28 (Conv2DT (None, 160, 48, 64)       36928     
_________________________________________________________________
conv2d_transpose_29 (Conv2DT (None, 320, 96, 64)       36928     
_________________________________________________________________
conv2d_transpose_30 (Conv2DT (None, 320, 96, 1)        577       
_________________________________________________________________
cropping2d_6 (Cropping2D)    (None, 309, 84, 1)        0         
_________________________________________________________________
decoder_output (Activation)  (None, 309, 84, 1)        0         
=================================================================
Total params: 1,139,009
Trainable params: 1,139,009
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
encoder (Model)              [(None, 128), (None, 128) 4175424   
_________________________________________________________________
decoder (Model)              (None, 309, 84, 1)        1139009   
=================================================================
Total params: 5,314,433
Trainable params: 5,314,433
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.016462247810429997, 0.014828174047999913, 0.01189709717200862, 0.011821929067373275, 0.010927747148606512, 0.009988440113763014, 0.009364477429125044, 0.009217964654995336, 0.010034718679057227, 0.00877251156916221, 0.008513578143384722, 0.008140722542173332, 0.00815037602558732, 0.008219558766318693, 0.007869150564074516, 0.007597628368271722, 0.00802292026165459, 0.007746545448899269, 0.00729801814382275, 0.007333329433782233], 'loss': [0.06012494247820642, 0.015063340992977221, 0.013447767934865422, 0.012234621261143021, 0.011567442475093736, 0.010685091698542237, 0.010509107479204733, 0.009948536755724085, 0.009666266713498368, 0.009522046128080951, 0.009216942998270194, 0.008903775177896023, 0.009036018068177833, 0.008451286981710129, 0.008284820210602548, 0.008278662273660302, 0.008333185729053285, 0.007955106808286575, 0.008078019784556495, 0.007812744142073724]}