Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 1, 80, 84, 64)     1792      
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 1, 40, 42, 64)     36928     
_________________________________________________________________
conv3d_3 (Conv3D)            (None, 1, 20, 21, 64)     36928     
_________________________________________________________________
conv3d_4 (Conv3D)            (None, 1, 10, 11, 64)     36928     
_________________________________________________________________
reshape_1 (Reshape)          (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 1024)              7209984   
_________________________________________________________________
latent_space (Dense)         (None, 512)               524800    
=================================================================
Total params: 7,847,360
Trainable params: 7,847,360
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 512)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 7040)              3611520   
_________________________________________________________________
reshape_2 (Reshape)          (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_1 (Conv3DTr (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_2 (Conv3DTr (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_3 (Conv3DTr (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_4 (Conv3DTr (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_5 (Conv3DTr (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_1 (Cropping3D)    (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 3,834,689
Trainable params: 3,834,689
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              (None, 512)               7847360   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    3834689   
=================================================================
Total params: 11,682,049
Trainable params: 11,682,049
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.05612030082941055, 0.05457472640275955, 0.05330441188812256, 0.05243076241016388, 0.05203343003988266], 'loss': [0.06136961464583874, 0.05120194290578366, 0.04996588802337647, 0.048672171965241436, 0.0473226025775075]}