Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 3, 160, 168,  0                                            
__________________________________________________________________________________________________
conv3d_5 (Conv3D)               (None, 1, 80, 84, 64 1792        encoded_input[0][0]              
__________________________________________________________________________________________________
conv3d_6 (Conv3D)               (None, 1, 40, 42, 64 36928       conv3d_5[0][0]                   
__________________________________________________________________________________________________
conv3d_7 (Conv3D)               (None, 1, 20, 21, 64 36928       conv3d_6[0][0]                   
__________________________________________________________________________________________________
conv3d_8 (Conv3D)               (None, 1, 10, 11, 64 36928       conv3d_7[0][0]                   
__________________________________________________________________________________________________
reshape_3 (Reshape)             (None, 7040)         0           conv3d_8[0][0]                   
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 1024)         7209984     reshape_3[0][0]                  
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 512)          524800      dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 512)          524800      dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 512)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 8,372,160
Trainable params: 8,372,160
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 512)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 7040)              3611520   
_________________________________________________________________
reshape_4 (Reshape)          (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_6 (Conv3DTr (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_7 (Conv3DTr (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_8 (Conv3DTr (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_9 (Conv3DTr (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_10 (Conv3DT (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_2 (Cropping3D)    (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 3,834,689
Trainable params: 3,834,689
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              [(None, 512), (None, 512) 8372160   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    3834689   
=================================================================
Total params: 12,206,849
Trainable params: 12,206,849
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.07039235520362853, 0.06791913425922394, 0.06655336040258407, 0.06518171036243439, 0.06483908486366272], 'loss': [0.07735792729258538, 0.06660223226249218, 0.06478005276620388, 0.06320640632510185, 0.062367563262581825]}