Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 155, 42, 64)       640       
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 78, 21, 64)        36928     
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 39, 11, 64)        36928     
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 20, 6, 64)         36928     
_________________________________________________________________
reshape_9 (Reshape)          (None, 7680)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 256)               1966336   
_________________________________________________________________
latent_space (Dense)         (None, 64)                16448     
=================================================================
Total params: 2,094,208
Trainable params: 2,094,208
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 64)                0         
_________________________________________________________________
dense_5 (Dense)              (None, 7680)              499200    
_________________________________________________________________
reshape_10 (Reshape)         (None, 20, 6, 64)         0         
_________________________________________________________________
conv2d_transpose_21 (Conv2DT (None, 40, 12, 64)        36928     
_________________________________________________________________
conv2d_transpose_22 (Conv2DT (None, 80, 24, 64)        36928     
_________________________________________________________________
conv2d_transpose_23 (Conv2DT (None, 160, 48, 64)       36928     
_________________________________________________________________
conv2d_transpose_24 (Conv2DT (None, 320, 96, 64)       36928     
_________________________________________________________________
conv2d_transpose_25 (Conv2DT (None, 320, 96, 1)        577       
_________________________________________________________________
cropping2d_5 (Cropping2D)    (None, 309, 84, 1)        0         
_________________________________________________________________
decoder_output (Activation)  (None, 309, 84, 1)        0         
=================================================================
Total params: 647,489
Trainable params: 647,489
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
encoder (Model)              (None, 64)                2094208   
_________________________________________________________________
decoder (Model)              (None, 309, 84, 1)        647489    
=================================================================
Total params: 2,741,697
Trainable params: 2,741,697
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.012025979962199927, 0.005979536790400744, 0.005106688464681307, 0.004064524710799257, 0.003657681383192539, 0.0032480082319428522, 0.0035523668474828204, 0.003325520516373217, 0.002758064491984745, 0.002689013892474274], 'loss': [0.08181361279295137, 0.007942415801032136, 0.005182875822453449, 0.004294006982042144, 0.0037974450706193845, 0.0033528918757413824, 0.003287072464202841, 0.002894877583409349, 0.002766553595041235, 0.0026195492102609325]}