Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 309, 84, 1)     0         
_________________________________________________________________
conv3d_5 (Conv3D)            (None, 1, 155, 42, 64)    1792      
_________________________________________________________________
conv3d_6 (Conv3D)            (None, 1, 78, 21, 64)     36928     
_________________________________________________________________
conv3d_7 (Conv3D)            (None, 1, 39, 11, 64)     36928     
_________________________________________________________________
conv3d_8 (Conv3D)            (None, 1, 20, 6, 64)      36928     
_________________________________________________________________
reshape_3 (Reshape)          (None, 7680)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 512)               3932672   
_________________________________________________________________
latent_space (Dense)         (None, 256)               131328    
=================================================================
Total params: 4,176,576
Trainable params: 4,176,576
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 256)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 7680)              1973760   
_________________________________________________________________
reshape_4 (Reshape)          (None, 1, 20, 6, 64)      0         
_________________________________________________________________
conv3d_transpose_6 (Conv3DTr (None, 1, 40, 12, 64)     36928     
_________________________________________________________________
conv3d_transpose_7 (Conv3DTr (None, 1, 80, 24, 64)     36928     
_________________________________________________________________
conv3d_transpose_8 (Conv3DTr (None, 1, 160, 48, 64)    36928     
_________________________________________________________________
conv3d_transpose_9 (Conv3DTr (None, 3, 320, 96, 64)    110656    
_________________________________________________________________
conv3d_transpose_10 (Conv3DT (None, 3, 320, 96, 1)     1729      
_________________________________________________________________
cropping3d_2 (Cropping3D)    (None, 3, 309, 84, 1)     0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 309, 84, 1)     0         
=================================================================
Total params: 2,196,929
Trainable params: 2,196,929
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 309, 84, 1)     0         
_________________________________________________________________
encoder (Model)              (None, 256)               4176576   
_________________________________________________________________
decoder (Model)              (None, 3, 309, 84, 1)     2196929   
=================================================================
Total params: 6,373,505
Trainable params: 6,373,505
Non-trainable params: 0
_________________________________________________________________
