Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
conv3d_9 (Conv3D)            (None, 1, 80, 84, 64)     1792      
_________________________________________________________________
conv3d_10 (Conv3D)           (None, 1, 40, 42, 64)     36928     
_________________________________________________________________
conv3d_11 (Conv3D)           (None, 1, 20, 21, 64)     36928     
_________________________________________________________________
conv3d_12 (Conv3D)           (None, 1, 10, 11, 64)     36928     
_________________________________________________________________
reshape_5 (Reshape)          (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 128)               901248    
_________________________________________________________________
latent_space (Dense)         (None, 32)                4128      
=================================================================
Total params: 1,017,952
Trainable params: 1,017,952
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.07540766537189483, 0.059876716941595076, 0.05548005458712578, 0.050950970470905306, 0.04926807472109795, 0.047393605440855024, 0.04699285632371902, 0.04866858825087547, 0.04843694818019867, 0.04536948943138123, 0.044446473032236096, 0.04378260335326195, 0.04340471839904785, 0.04299594721198082, 0.042873662143945696, 0.04516795039176941, 0.04196068874001503, 0.0416846085190773, 0.04145137342810631, 0.12222098958492279], 'loss': [0.29846483056247236, 0.06683642803132533, 0.05682187831401825, 0.05232110022008419, 0.0524886237680912, 0.04868090735375881, 0.04738973820209503, 0.04718464808166027, 0.07006690313667059, 0.04629840881377459, 0.04445852828770876, 0.04415780752897262, 0.04310312944278121, 0.04248886552453041, 0.04239693501591683, 0.04351709520816803, 0.04248110780864954, 0.04091888066381216, 0.04060819448530674, 0.04286503694206476]}loss_history: {'val_loss': [0.06764560043811799, 0.06395428681373597, 0.06292395007610321, 0.06111741638183594, 0.06007424932718277], 'loss': [0.07681986558437347, 0.06356272220611572, 0.06089122174680233, 0.05938633993268013, 0.058164625063538554]}