Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 3, 160, 168,  0                                            
__________________________________________________________________________________________________
conv3d_1 (Conv3D)               (None, 1, 80, 84, 64 1792        encoded_input[0][0]              
__________________________________________________________________________________________________
conv3d_2 (Conv3D)               (None, 1, 40, 42, 64 36928       conv3d_1[0][0]                   
__________________________________________________________________________________________________
conv3d_3 (Conv3D)               (None, 1, 20, 21, 64 36928       conv3d_2[0][0]                   
__________________________________________________________________________________________________
conv3d_4 (Conv3D)               (None, 1, 10, 11, 64 36928       conv3d_3[0][0]                   
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 7040)         0           conv3d_4[0][0]                   
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 1024)         7209984     reshape_1[0][0]                  
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 512)          524800      dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 512)          524800      dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 512)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 8,372,160
Trainable params: 8,372,160
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 512)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 7040)              3611520   
_________________________________________________________________
reshape_2 (Reshape)          (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_1 (Conv3DTr (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_2 (Conv3DTr (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_3 (Conv3DTr (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_4 (Conv3DTr (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_5 (Conv3DTr (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_1 (Cropping3D)    (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 3,834,689
Trainable params: 3,834,689
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              [(None, 512), (None, 512) 8372160   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    3834689   
=================================================================
Total params: 12,206,849
Trainable params: 12,206,849
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.051517189115285876, 0.05033750903606415, 0.048964351415634155, 0.047817094832658766, 0.04741596785187721, 0.046587107330560686, 0.046858086049556734, 0.04678419816493988, 0.04566679096221924, 0.0457414468228817], 'loss': [0.059895404815673826, 0.0507129650041461, 0.04943115258961916, 0.04789289189875126, 0.04701827835291624, 0.04638145572692156, 0.04593178512901068, 0.04547055128216743, 0.044855787537992, 0.04445059607923031]}loss_history: {'val_loss': [0.07165869599580765, 0.06815135324001312, 0.06709745538234711, 0.06595476377010345, 0.06530124348402024], 'loss': [0.08367056328058242, 0.06733681704103947, 0.06547382824122906, 0.06409167490899563, 0.06347330282628537]}