Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 160, 168, 1)  0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 80, 84, 64)   640         encoded_input[0][0]              
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 40, 42, 64)   36928       conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 20, 21, 64)   36928       conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 10, 11, 64)   36928       conv2d_3[0][0]                   
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 7040)         0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 512)          3604992     reshape_1[0][0]                  
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 128)          65664       dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 128)          65664       dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 128)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 3,847,744
Trainable params: 3,847,744
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 7040)              908160    
_________________________________________________________________
reshape_2 (Reshape)          (None, 10, 11, 64)        0         
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 20, 22, 64)        36928     
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 40, 44, 64)        36928     
_________________________________________________________________
conv2d_transpose_3 (Conv2DTr (None, 80, 88, 64)        36928     
_________________________________________________________________
conv2d_transpose_4 (Conv2DTr (None, 160, 176, 64)      36928     
_________________________________________________________________
conv2d_transpose_5 (Conv2DTr (None, 160, 176, 1)       577       
_________________________________________________________________
cropping2d_1 (Cropping2D)    (None, 160, 168, 1)       0         
_________________________________________________________________
decoder_output (Activation)  (None, 160, 168, 1)       0         
=================================================================
Total params: 1,056,449
Trainable params: 1,056,449
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 160, 168, 1)       0         
_________________________________________________________________
encoder (Model)              [(None, 128), (None, 128) 3847744   
_________________________________________________________________
decoder (Model)              (None, 160, 168, 1)       1056449   
=================================================================
Total params: 4,904,193
Trainable params: 4,904,193
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.056551855628689134, 0.055533246820171675, 0.0551197416583697], 'loss': [0.0630825389859577, 0.05506431959879895, 0.054359201254944006]}