Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 3, 160, 168,  0                                            
__________________________________________________________________________________________________
conv3d_61 (Conv3D)              (None, 1, 80, 84, 64 1792        encoded_input[0][0]              
__________________________________________________________________________________________________
conv3d_62 (Conv3D)              (None, 1, 40, 42, 64 36928       conv3d_61[0][0]                  
__________________________________________________________________________________________________
conv3d_63 (Conv3D)              (None, 1, 20, 21, 64 36928       conv3d_62[0][0]                  
__________________________________________________________________________________________________
conv3d_64 (Conv3D)              (None, 1, 10, 11, 64 36928       conv3d_63[0][0]                  
__________________________________________________________________________________________________
reshape_31 (Reshape)            (None, 7040)         0           conv3d_64[0][0]                  
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 512)          3604992     reshape_31[0][0]                 
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 512)          262656      dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 512)          262656      dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 512)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 4,242,880
Trainable params: 4,242,880
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 512)               0         
_________________________________________________________________
dense_16 (Dense)             (None, 7040)              3611520   
_________________________________________________________________
reshape_32 (Reshape)         (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_76 (Conv3DT (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_77 (Conv3DT (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_78 (Conv3DT (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_79 (Conv3DT (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_80 (Conv3DT (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_16 (Cropping3D)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 3,834,689
Trainable params: 3,834,689
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              [(None, 512), (None, 512) 4242880   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    3834689   
=================================================================
Total params: 8,077,569
Trainable params: 8,077,569
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.041814827650785445, 0.0411846678853035, 0.04075528711080551, 0.040870981276035306, 0.04111440756917, 0.04059870758652687, 0.040344311505556105, 0.04036990940570831, 0.04012988364696503, 0.04027474680542946], 'loss': [0.03946721009910106, 0.039133349291980264, 0.03862803804129362, 0.03855002432316541, 0.038231203489005564, 0.038140189357101915, 0.037705136150121686, 0.03766848026961088, 0.03739542528241873, 0.037168189212679864]}loss_history: {'val_loss': [0.060781383216381074, 0.059800032019615174, 0.05929489725828171, 0.05892234516143799, 0.05851122891902923], 'loss': [0.07241582328081131, 0.05570833252370357, 0.05469337600469589, 0.05406294724345207, 0.053638790994882585]}loss_history: {'val_loss': [0.05826676398515701, 0.05772714102268219, 0.057437861859798434, 0.057552327811717985, 0.057222617626190186], 'loss': [0.053419022515416144, 0.05299352204054594, 0.052727671399712565, 0.05228022687882185, 0.05215276224911213]}loss_history: {'val_loss': [0.05607203161716461, 0.05606444245576859, 0.05562219172716141, 0.05577460819482803, 0.05543856555223465], 'loss': [0.05077955524623394, 0.05013808620721102, 0.04991036492586136, 0.04969096805155277, 0.04937369814515114]}