Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 155, 42, 64)       640       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 78, 21, 64)        36928     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 39, 11, 64)        36928     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 20, 6, 64)         36928     
_________________________________________________________________
reshape_1 (Reshape)          (None, 7680)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 256)               1966336   
_________________________________________________________________
latent_space (Dense)         (None, 64)                16448     
=================================================================
Total params: 2,094,208
Trainable params: 2,094,208
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 64)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 7680)              499200    
_________________________________________________________________
reshape_2 (Reshape)          (None, 20, 6, 64)         0         
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 40, 12, 64)        36928     
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 80, 24, 64)        36928     
_________________________________________________________________
conv2d_transpose_3 (Conv2DTr (None, 160, 48, 64)       36928     
_________________________________________________________________
conv2d_transpose_4 (Conv2DTr (None, 320, 96, 64)       36928     
_________________________________________________________________
conv2d_transpose_5 (Conv2DTr (None, 320, 96, 1)        577       
_________________________________________________________________
cropping2d_1 (Cropping2D)    (None, 309, 84, 1)        0         
_________________________________________________________________
decoder_output (Activation)  (None, 309, 84, 1)        0         
=================================================================
Total params: 647,489
Trainable params: 647,489
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
encoder (Model)              (None, 64)                2094208   
_________________________________________________________________
decoder (Model)              (None, 309, 84, 1)        647489    
=================================================================
Total params: 2,741,697
Trainable params: 2,741,697
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.012080950128535429, 0.006692902905245622, 0.004963336745277047, 0.004143996769562364, 0.0041521881272395455, 0.0034685873504107195, 0.0034436857296774783, 0.0031827573431655763, 0.0029144693786899247, 0.0027199846599251032], 'loss': [0.09304007750935853, 0.00923953676984335, 0.005475544116149346, 0.004769475803865741, 0.0037748372201652576, 0.0034512418908222266, 0.0031559922996287544, 0.0030721272621303795, 0.002769169540842995, 0.002609675979086508]}