Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
conv3d_17 (Conv3D)           (None, 1, 80, 84, 64)     1792      
_________________________________________________________________
conv3d_18 (Conv3D)           (None, 1, 40, 42, 64)     36928     
_________________________________________________________________
conv3d_19 (Conv3D)           (None, 1, 20, 21, 64)     36928     
_________________________________________________________________
conv3d_20 (Conv3D)           (None, 1, 10, 11, 64)     36928     
_________________________________________________________________
reshape_9 (Reshape)          (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 128)               901248    
_________________________________________________________________
latent_space (Dense)         (None, 32)                4128      
=================================================================
Total params: 1,017,952
Trainable params: 1,017,952
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.10633679008483887, 0.06657477533817291, 0.06013734042644501, 0.05341187623143196, 0.0529626570045948, 0.049362360924482346, 0.04765664386749267, 0.04688773107528686, 0.046163850635290146, 0.04596998170018196, 0.044597369134426114, 0.04934586751461029, 0.04391593736410141, 0.0433309032022953, 0.04345161390304565, 0.0428642241358757, 0.04239773949980736, 0.04227099439501762, 0.054707697808742524, 0.041698596477508544], 'loss': [0.4063178017139435, 0.07628593902289868, 0.06249872875213623, 0.0608348780348897, 0.052942877002060414, 0.05131181847304106, 0.048429014898836616, 0.048132386721670625, 0.046285458400845525, 0.048571944788098335, 0.04468027777224779, 0.044404912628233435, 0.04594950193166733, 0.04334021127969027, 0.042896490678191186, 0.04441780031472445, 0.041915062099695206, 0.04170669934153557, 0.042718991972506046, 0.04188199705630541]}loss_history: {'val_loss': [0.06362970858812332, 0.061395087897777555, 0.06101422828435898, 0.059090584754943845, 0.058583573400974275], 'loss': [0.07060658098757266, 0.060162381589412686, 0.05829003897309303, 0.05733615367114544, 0.05624261747300625]}