Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
conv3d_25 (Conv3D)           (None, 1, 80, 84, 64)     1792      
_________________________________________________________________
conv3d_26 (Conv3D)           (None, 1, 40, 42, 64)     36928     
_________________________________________________________________
conv3d_27 (Conv3D)           (None, 1, 20, 21, 64)     36928     
_________________________________________________________________
conv3d_28 (Conv3D)           (None, 1, 10, 11, 64)     36928     
_________________________________________________________________
reshape_13 (Reshape)         (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 512)               3604992   
_________________________________________________________________
latent_space (Dense)         (None, 256)               131328    
=================================================================
Total params: 3,848,896
Trainable params: 3,848,896
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 256)               0         
_________________________________________________________________
dense_7 (Dense)              (None, 7040)              1809280   
_________________________________________________________________
reshape_14 (Reshape)         (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_31 (Conv3DT (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_32 (Conv3DT (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_33 (Conv3DT (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_34 (Conv3DT (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_35 (Conv3DT (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_7 (Cropping3D)    (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 2,032,449
Trainable params: 2,032,449
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              (None, 256)               3848896   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    2032449   
=================================================================
Total params: 5,881,345
Trainable params: 5,881,345
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.0748539971113205, 0.06923499196767807, 0.06495489931106567, 0.06242602384090424, 0.059805010855197904], 'loss': [0.09859814956784248, 0.0679817690551281, 0.06281294548511505, 0.059017509877681736, 0.05621391589939594]}