Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
conv3d_57 (Conv3D)           (None, 1, 80, 84, 64)     1792      
_________________________________________________________________
conv3d_58 (Conv3D)           (None, 1, 40, 42, 64)     36928     
_________________________________________________________________
conv3d_59 (Conv3D)           (None, 1, 20, 21, 64)     36928     
_________________________________________________________________
conv3d_60 (Conv3D)           (None, 1, 10, 11, 64)     36928     
_________________________________________________________________
reshape_29 (Reshape)         (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 512)               3604992   
_________________________________________________________________
latent_space (Dense)         (None, 256)               131328    
=================================================================
Total params: 3,848,896
Trainable params: 3,848,896
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 256)               0         
_________________________________________________________________
dense_15 (Dense)             (None, 7040)              1809280   
_________________________________________________________________
reshape_30 (Reshape)         (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_71 (Conv3DT (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_72 (Conv3DT (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_73 (Conv3DT (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_74 (Conv3DT (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_75 (Conv3DT (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_15 (Cropping3D)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 2,032,449
Trainable params: 2,032,449
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              (None, 256)               3848896   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    2032449   
=================================================================
Total params: 5,881,345
Trainable params: 5,881,345
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.07159683305025101, 0.06660850173234939, 0.06357684314250946, 0.06101231026649475, 0.059487597525119784], 'loss': [0.09862566627562046, 0.06552718809247017, 0.06126850441098213, 0.058270976200699806, 0.055660721376538276]}