Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 309, 84, 1)   0                                            
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 155, 42, 64)  640         encoded_input[0][0]              
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 78, 21, 64)   36928       conv2d_5[0][0]                   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 39, 11, 64)   36928       conv2d_6[0][0]                   
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 20, 6, 64)    36928       conv2d_7[0][0]                   
__________________________________________________________________________________________________
reshape_3 (Reshape)             (None, 7680)         0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 512)          3932672     reshape_3[0][0]                  
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 128)          65664       dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 128)          65664       dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 128)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 4,175,424
Trainable params: 4,175,424
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 128)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 7680)              990720    
_________________________________________________________________
reshape_4 (Reshape)          (None, 20, 6, 64)         0         
_________________________________________________________________
conv2d_transpose_6 (Conv2DTr (None, 40, 12, 64)        36928     
_________________________________________________________________
conv2d_transpose_7 (Conv2DTr (None, 80, 24, 64)        36928     
_________________________________________________________________
conv2d_transpose_8 (Conv2DTr (None, 160, 48, 64)       36928     
_________________________________________________________________
conv2d_transpose_9 (Conv2DTr (None, 320, 96, 64)       36928     
_________________________________________________________________
conv2d_transpose_10 (Conv2DT (None, 320, 96, 1)        577       
_________________________________________________________________
cropping2d_2 (Cropping2D)    (None, 309, 84, 1)        0         
_________________________________________________________________
decoder_output (Activation)  (None, 309, 84, 1)        0         
=================================================================
Total params: 1,139,009
Trainable params: 1,139,009
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
encoder (Model)              [(None, 128), (None, 128) 4175424   
_________________________________________________________________
decoder (Model)              (None, 309, 84, 1)        1139009   
=================================================================
Total params: 5,314,433
Trainable params: 5,314,433
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.010514179882076051, 0.007807759365273847, 0.00756706272976266, 0.006316229512708054, 0.006446496985024876, 0.005727380565885041, 0.005638548048834006, 0.005143156331032514, 0.0051190013769600124, 0.005000185374584463, 0.004689552972300185, 0.004616001918911934, 0.004627077014495929, 0.004440332266191642, 0.004531833624674214, 0.004307532035228279, 0.004191161611427864, 0.004720185115519497, 0.004145598409490453, 0.004090079995286134], 'loss': [0.051323195269538296, 0.009353166025959782, 0.00789087449821333, 0.007028802995466524, 0.006586892207463582, 0.006094179996289313, 0.0057655515764943426, 0.005549878313516577, 0.005311436036912104, 0.005199047448630962, 0.005042807807007598, 0.005022327686763472, 0.004817477081798845, 0.004738559585789012, 0.004616293194186357, 0.004555821580708855, 0.0044995863714979755, 0.004432119169375963, 0.004578170463339322, 0.004320956072252658]}