Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
conv3d_5 (Conv3D)            (None, 1, 80, 84, 64)     1792      
_________________________________________________________________
conv3d_6 (Conv3D)            (None, 1, 40, 42, 64)     36928     
_________________________________________________________________
conv3d_7 (Conv3D)            (None, 1, 20, 21, 64)     36928     
_________________________________________________________________
conv3d_8 (Conv3D)            (None, 1, 10, 11, 64)     36928     
_________________________________________________________________
reshape_3 (Reshape)          (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 128)               901248    
_________________________________________________________________
latent_space (Dense)         (None, 32)                4128      
=================================================================
Total params: 1,017,952
Trainable params: 1,017,952
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.0711499183177948, 0.06431737351417542, 0.058749385446310046, 0.05171753704547882, 0.052581474512815474, 0.0492702057659626, 0.0474698474407196, 0.046682994306087494, 0.04661878436803818, 0.04680965113639832, 0.044939138442277905, 0.048173397213220594, 0.045516006708145144, 0.04542998552322388, 0.043653175204992296, 0.043321908742189406, 0.04304086917638779, 0.04250424483418465, 0.04214120775461197, 0.04200533246994018], 'loss': [0.2190818676352501, 0.06951890455186367, 0.05797408424317837, 0.05478227810561657, 0.0517415906637907, 0.05164880502969026, 0.04841751106083393, 0.04758178688585758, 0.0476292609795928, 0.04808507304638624, 0.04509965543448925, 0.04485670781135559, 0.04660361289232969, 0.04367111226171255, 0.04295579648017883, 0.042530221220105885, 0.042740936778485776, 0.0427452981248498, 0.04419243151694536, 0.04130486024171114]}loss_history: {'val_loss': [0.0683088189959526, 0.06542294526100159, 0.06472363913059234, 0.06306314128637314, 0.062474676072597504], 'loss': [0.07752504368126392, 0.06519625324010848, 0.06298210217058658, 0.06156265132129193, 0.060123332619667055]}