Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 3, 160, 168,  0                                            
__________________________________________________________________________________________________
conv3d_57 (Conv3D)              (None, 1, 80, 84, 64 1792        encoded_input[0][0]              
__________________________________________________________________________________________________
conv3d_58 (Conv3D)              (None, 1, 40, 42, 64 36928       conv3d_57[0][0]                  
__________________________________________________________________________________________________
conv3d_59 (Conv3D)              (None, 1, 20, 21, 64 36928       conv3d_58[0][0]                  
__________________________________________________________________________________________________
conv3d_60 (Conv3D)              (None, 1, 10, 11, 64 36928       conv3d_59[0][0]                  
__________________________________________________________________________________________________
reshape_29 (Reshape)            (None, 7040)         0           conv3d_60[0][0]                  
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 512)          3604992     reshape_29[0][0]                 
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 512)          262656      dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 512)          262656      dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 512)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 4,242,880
Trainable params: 4,242,880
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 512)               0         
_________________________________________________________________
dense_15 (Dense)             (None, 7040)              3611520   
_________________________________________________________________
reshape_30 (Reshape)         (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_71 (Conv3DT (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_72 (Conv3DT (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_73 (Conv3DT (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_74 (Conv3DT (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_75 (Conv3DT (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_15 (Cropping3D)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 3,834,689
Trainable params: 3,834,689
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              [(None, 512), (None, 512) 4242880   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    3834689   
=================================================================
Total params: 8,077,569
Trainable params: 8,077,569
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.04674585032463074, 0.04650989192724228, 0.04937088268995285, 0.04573756355047226, 0.04639570620656013, 0.04755372303724289, 0.0464173988699913, 0.045538211166858675, 0.04563933861255646, 0.045184759467840195], 'loss': [0.045568983756005765, 0.04623770541697741, 0.044808761619031426, 0.04463868691027165, 0.04439769767224789, 0.05049419483542442, 0.04468316649645567, 0.04425015373528004, 0.04363029688596726, 0.043741944566369054]}loss_history: {'val_loss': [0.06603366839885712, 0.06328143888711929, 0.06238741707801819, 0.06182355511188507, 0.061414993166923525], 'loss': [0.07747809098660946, 0.06068210108578205, 0.05898154337704182, 0.05794566321372986, 0.05728987585008145]}loss_history: {'val_loss': [0.06057610827684402, 0.059809805631637576, 0.059436962068080905, 0.059000466644763945, 0.05894620645046234], 'loss': [0.05690454295277596, 0.056009056881070135, 0.05559620147943497, 0.05485302525758743, 0.05461585657298565]}