Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoded_input (InputLayer)      (None, 309, 84, 1)   0                                            
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 155, 42, 64)  640         encoded_input[0][0]              
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 78, 21, 64)   36928       conv2d_17[0][0]                  
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 39, 11, 64)   36928       conv2d_18[0][0]                  
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 20, 6, 64)    36928       conv2d_19[0][0]                  
__________________________________________________________________________________________________
reshape_9 (Reshape)             (None, 7680)         0           conv2d_20[0][0]                  
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 1024)         7865344     reshape_9[0][0]                  
__________________________________________________________________________________________________
z_mean (Dense)                  (None, 256)          262400      dense_layer[0][0]                
__________________________________________________________________________________________________
z_log_var (Dense)               (None, 256)          262400      dense_layer[0][0]                
__________________________________________________________________________________________________
z (Lambda)                      (None, 256)          0           z_mean[0][0]                     
                                                                 z_log_var[0][0]                  
==================================================================================================
Total params: 8,501,568
Trainable params: 8,501,568
Non-trainable params: 0
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 256)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 7680)              1973760   
_________________________________________________________________
reshape_10 (Reshape)         (None, 20, 6, 64)         0         
_________________________________________________________________
conv2d_transpose_21 (Conv2DT (None, 40, 12, 64)        36928     
_________________________________________________________________
conv2d_transpose_22 (Conv2DT (None, 80, 24, 64)        36928     
_________________________________________________________________
conv2d_transpose_23 (Conv2DT (None, 160, 48, 64)       36928     
_________________________________________________________________
conv2d_transpose_24 (Conv2DT (None, 320, 96, 64)       36928     
_________________________________________________________________
conv2d_transpose_25 (Conv2DT (None, 320, 96, 1)        577       
_________________________________________________________________
cropping2d_5 (Cropping2D)    (None, 309, 84, 1)        0         
_________________________________________________________________
decoder_output (Activation)  (None, 309, 84, 1)        0         
=================================================================
Total params: 2,122,049
Trainable params: 2,122,049
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
encoder (Model)              [(None, 256), (None, 256) 8501568   
_________________________________________________________________
decoder (Model)              (None, 309, 84, 1)        2122049   
=================================================================
Total params: 10,623,617
Trainable params: 10,623,617
Non-trainable params: 0
_________________________________________________________________
Model: "vae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 309, 84, 1)        0         
_________________________________________________________________
encoder (Model)              [(None, 256), (None, 256) 8501568   
_________________________________________________________________
decoder (Model)              (None, 309, 84, 1)        2122049   
=================================================================
Total params: 10,623,617
Trainable params: 10,623,617
Non-trainable params: 0
_________________________________________________________________
val_loss: [0.0121462  0.01032388 0.00871433 0.00807851 0.00765429 0.00744865
 0.00729513 0.00693845 0.00715226 0.00722296 0.00644563 0.00613457
 0.00606226 0.00582747 0.0061947  0.0057085  0.00572541 0.00568743
 0.0055076  0.0060998  0.00542091 0.00538423 0.00545655 0.00511493
 0.00538814 0.005129   0.00502476 0.00517834 0.00509823 0.00540374]