Model: "encoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
conv3d_5 (Conv3D)            (None, 1, 80, 84, 64)     1792      
_________________________________________________________________
conv3d_6 (Conv3D)            (None, 1, 40, 42, 64)     36928     
_________________________________________________________________
conv3d_7 (Conv3D)            (None, 1, 20, 21, 64)     36928     
_________________________________________________________________
conv3d_8 (Conv3D)            (None, 1, 10, 11, 64)     36928     
_________________________________________________________________
reshape_3 (Reshape)          (None, 7040)              0         
_________________________________________________________________
dense_layer (Dense)          (None, 128)               901248    
_________________________________________________________________
latent_space (Dense)         (None, 2)                 258       
=================================================================
Total params: 1,014,082
Trainable params: 1,014,082
Non-trainable params: 0
_________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoded_input (InputLayer)   (None, 2)                 0         
_________________________________________________________________
dense_2 (Dense)              (None, 7040)              21120     
_________________________________________________________________
reshape_4 (Reshape)          (None, 1, 10, 11, 64)     0         
_________________________________________________________________
conv3d_transpose_6 (Conv3DTr (None, 1, 20, 22, 64)     36928     
_________________________________________________________________
conv3d_transpose_7 (Conv3DTr (None, 1, 40, 44, 64)     36928     
_________________________________________________________________
conv3d_transpose_8 (Conv3DTr (None, 1, 80, 88, 64)     36928     
_________________________________________________________________
conv3d_transpose_9 (Conv3DTr (None, 3, 160, 176, 64)   110656    
_________________________________________________________________
conv3d_transpose_10 (Conv3DT (None, 3, 160, 176, 1)    1729      
_________________________________________________________________
cropping3d_2 (Cropping3D)    (None, 3, 160, 168, 1)    0         
_________________________________________________________________
decoder_output (Activation)  (None, 3, 160, 168, 1)    0         
=================================================================
Total params: 244,289
Trainable params: 244,289
Non-trainable params: 0
_________________________________________________________________
Model: "autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoded_input (InputLayer)   (None, 3, 160, 168, 1)    0         
_________________________________________________________________
encoder (Model)              (None, 2)                 1014082   
_________________________________________________________________
decoder (Model)              (None, 3, 160, 168, 1)    244289    
=================================================================
Total params: 1,258,371
Trainable params: 1,258,371
Non-trainable params: 0
_________________________________________________________________
loss_history: {'val_loss': [0.19668242478370668, 0.1912874300479889, 0.19183416831493377, 0.19309647083282472, 0.19079049503803253, 0.19066829705238342, 0.19424739480018616, 0.19048921370506286, 0.19084320378303526, 0.1906094869375229, 0.19087205135822297, 0.191058225274086, 0.19192267382144929, 0.19016677284240724, 0.19047724783420564, 0.19013854718208312, 0.1910693703889847, 0.19073857474327088, 0.19027547073364257, 0.1918394206762314], 'loss': [0.5554692078232765, 0.19326145082712173, 0.19257988655567168, 0.19214559268951417, 0.1919613472223282, 0.1918146733045578, 0.19170650154352187, 0.19180734699964525, 0.19164267194271087, 0.19185644137859345, 0.1916558692455292, 0.19150151908397675, 0.19162669152021408, 0.19151821857690812, 0.19156928044557572, 0.19170806521177292, 0.19154081606864928, 0.19148760032653808, 0.1914564581513405, 0.19139575058221817]}